[
  {
    "id": "idiom_9565",
    "idiom": "work to rule",
    "definition": "To work slowly by strictly following all work rules, usually in a work-to-rule job action, as part of unionized labor protest.",
    "wrongDefinitions": [
      "exactly what \"work to rule\" sounds like",
      "to make things better",
      "to delay an action"
    ],
    "examples": [],
    "wrongExamples": [
      "work from rule",
      "You should never work to rule in public.",
      "It takes practice to work to rule correctly.",
      "They forgot to work to rule before leaving.",
      "She learned to work to rule at school."
    ],
    "context": "UK"
  },
  {
    "id": "idiom_9566",
    "idiom": "work with one's hands",
    "definition": "To engage in difficult manual labor, especially using analog tools.",
    "wrongDefinitions": [
      "exactly what \"work with one's hands\" sounds like",
      "to face challenges",
      "to delay an action"
    ],
    "examples": [],
    "wrongExamples": [
      "work of one's hands",
      "work with one's",
      "Can you teach me to work with one's hands?",
      "I always work with one's hands on Mondays.",
      "She learned to work with one's hands at school."
    ]
  },
  {
    "id": "idiom_9567",
    "idiom": "work wonders",
    "definition": "To perform miracles or magic.",
    "wrongDefinitions": [
      "exactly what \"work wonders\" sounds like",
      "to achieve success",
      "to repeat an error"
    ],
    "examples": [],
    "wrongExamples": [
      "She learned to work wonders at school.",
      "The instructions said to work wonders first thing in the morning.",
      "Everyone should work wonders at least once.",
      "I always work wonders on Mondays.",
      "Can you teach me to work wonders?"
    ]
  },
  {
    "id": "idiom_9568",
    "idiom": "world-beater",
    "definition": "Someone or something superior to all others of its sort.",
    "wrongDefinitions": [
      "a literal world-beater",
      "to achieve success",
      "showing poor judgment"
    ],
    "examples": [],
    "wrongExamples": [
      "That world-beater looks brand new.",
      "This world-beater is made of plastic.",
      "Where can I find a good world-beater?",
      "He bought a world-beater at the store.",
      "The world-beater was on sale yesterday."
    ]
  },
  {
    "id": "idiom_9569",
    "idiom": "world of difference",
    "definition": "A great or insurmountable difference.",
    "wrongDefinitions": [
      "a literal world of difference",
      "a beneficial outcome",
      "to prepare for something"
    ],
    "examples": [
      {
        "sentence": "There's a world of difference between sushi and poké bowls."
      },
      {
        "sentence": "There is a world of difference betweene the termes of disobedience, and of deposition. It is one thing to disobey the Kings commaund in matters prohibited by diuine lawes, and yet in all other matters to performe full subiection vnto the King. It is another thing of a farre higher degree or straine of disloyaltie, to bare the King of his Royall robes, throne, and scepter, and when he is thus farre disgraced, to degrade him and to put him from his degree and place of a King."
      },
      {
        "sentence": "Less than six months separate these two days of the year, but some six or seven years of playwriting have intervened and that world of difference between summer and winter."
      }
    ],
    "wrongExamples": [
      "My friend owns three world of differences.",
      "This world of difference is made of plastic.",
      "She lost her world of difference last week.",
      "That world of difference looks brand new.",
      "The price of world of differences has gone up."
    ]
  },
  {
    "id": "idiom_957",
    "idiom": "break one's chops",
    "definition": "To give someone a hard time, harass, nag one to do something, bother.",
    "wrongDefinitions": [
      "to shatter one's chops",
      "to lose control",
      "to repeat an error"
    ],
    "examples": [
      {
        "sentence": "\"And why don't you stop breaking my chops, eh?\"."
      }
    ],
    "wrongExamples": [
      "broke one's chops",
      "It takes practice to break one's chops correctly.",
      "The manual shows how to break one's chops properly.",
      "She learned to break one's chops at school.",
      "Can you teach me to break one's chops?"
    ]
  },
  {
    "id": "idiom_9570",
    "idiom": "world record",
    "definition": "The world's best score or time for a certain event.",
    "wrongDefinitions": [
      "a literal world record",
      "a common mistake",
      "to prepare for something"
    ],
    "examples": [
      {
        "sentence": "Cantonese: 世界紀錄 / 世界纪录 (sai3 gaai3 gei2 luk6)."
      },
      {
        "sentence": "Bokmål: verdensrekord (no) m."
      }
    ],
    "wrongExamples": [
      "That world record looks brand new.",
      "She collected several world records for her hobby.",
      "The world record was on sale yesterday.",
      "The price of world records has gone up.",
      "My friend owns three world records."
    ]
  },
  {
    "id": "idiom_9571",
    "idiom": "worlds apart",
    "definition": "Vastly different.",
    "wrongDefinitions": [
      "a literal worlds apart",
      "something done carelessly",
      "lacking preparation"
    ],
    "examples": [
      {
        "sentence": "In terms of technology, today's media and that of the 19th century are worlds apart, but they still serve the same purpose."
      }
    ],
    "wrongExamples": [
      "That worlds apart looks brand new.",
      "She collected several worlds aparts for her hobby.",
      "The worlds apart was on sale yesterday.",
      "He bought a worlds apart at the store.",
      "The price of worlds aparts has gone up."
    ]
  },
  {
    "id": "idiom_9572",
    "idiom": "worlds away",
    "definition": "Vastly different; incompatible.",
    "wrongDefinitions": [
      "a literal worlds away",
      "to show weakness",
      "having excessive pride"
    ],
    "examples": [],
    "wrongExamples": [
      "I've never seen a worlds away like that before.",
      "She collected several worlds aways for her hobby.",
      "My friend owns three worlds aways.",
      "That worlds away looks brand new.",
      "The price of worlds aways has gone up."
    ]
  },
  {
    "id": "idiom_9573",
    "idiom": "worm food",
    "definition": "One or more corpses, especially in a state of decay; remains.",
    "wrongDefinitions": [
      "a literal worm food",
      "to create confusion",
      "appearing foolish"
    ],
    "examples": [
      {
        "sentence": "At a state clemency board hearing earlier this month, a prosecutor said that Mr. Parker once joked that he had turned the Warrens into \"worm food."
      },
      {
        "sentence": "It's something that you want to do instead of being ashes or worm food, to be some kind of asset instead of being in the ground,\" she said."
      },
      {
        "sentence": "[F]or those of us who think that the grave is the end of us, when we shall become food for worms, the sensible course is to make the most of every passing hour."
      }
    ],
    "wrongExamples": [
      "He bought a worm food at the store.",
      "The price of worm foods has gone up.",
      "That worm food looks brand new.",
      "I've never seen a worm food like that before.",
      "This worm food is made of plastic."
    ]
  },
  {
    "id": "idiom_9574",
    "idiom": "worm's-eye view",
    "definition": "A view of an object from below, from the ground.",
    "wrongDefinitions": [
      "a literal worm's-eye view",
      "to show weakness",
      "demonstrating skill"
    ],
    "examples": [],
    "wrongExamples": [
      "Where can I find a good worm's-eye view?",
      "That worm's-eye view looks brand new.",
      "I've never seen a worm's-eye view like that before.",
      "The worm's-eye view was on sale yesterday.",
      "She lost her worm's-eye view last week."
    ]
  },
  {
    "id": "idiom_9575",
    "idiom": "worm turns",
    "definition": "Circumstances change so that a previously disadvantaged party gains the advantage, or vice-versa.",
    "wrongDefinitions": [
      "a literal worm turns",
      "something done carelessly",
      "being too confident"
    ],
    "examples": [
      {
        "sentence": "The poor old Worm turns as if she was treading on him instead of cuddling him like a pussy cat."
      },
      {
        "sentence": "I've waited on you hand and foot, done dirty work for you, put up with your ill-humours and your tyranny, and never grumbled. But there is a limit! You've made a poor sort of creature of me, but even the worm turns, you know."
      },
      {
        "sentence": "However, the evidence to date in the new session indicates the worm may have turned. The government has become more seasoned and confident of its political skills."
      }
    ],
    "wrongExamples": [
      "The price of worm turnss has gone up.",
      "My friend owns three worm turnss.",
      "That worm turns looks brand new.",
      "She collected several worm turnss for her hobby.",
      "The worm turns was on sale yesterday."
    ]
  },
  {
    "id": "idiom_9576",
    "idiom": "worse for liquor",
    "definition": "Drunk, either at one particular time or often over a long period.",
    "wrongDefinitions": [
      "a literal worse for liquor",
      "to face challenges",
      "appearing foolish"
    ],
    "examples": [
      {
        "sentence": "Synonyms: worse for wear (in its figurative sense); see also Thesaurus:drunk."
      }
    ],
    "wrongExamples": [
      "He bought a worse for liquor at the store.",
      "The worse for liquor was on sale yesterday.",
      "Where can I find a good worse for liquor?",
      "She lost her worse for liquor last week.",
      "The price of worse for liquors has gone up."
    ]
  },
  {
    "id": "idiom_9577",
    "idiom": "worse for wear",
    "definition": "In poor physical condition due to long or heavy use.",
    "wrongDefinitions": [
      "a literal worse for wear",
      "a beneficial outcome",
      "experiencing confusion"
    ],
    "examples": [
      {
        "sentence": "However, before Zoe could open the first cage, Burt's van, looking decidedly the worse for wear, came thundering into the warehouse, smashing the huge metal sliding door into the air as it did so."
      }
    ],
    "wrongExamples": [
      "She lost her worse for wear last week.",
      "The price of worse for wears has gone up.",
      "The worse for wear was on sale yesterday.",
      "This worse for wear is made of plastic.",
      "He bought a worse for wear at the store."
    ]
  },
  {
    "id": "idiom_9578",
    "idiom": "worship the ground someone walks on",
    "definition": "To admire or adore someone to excess.",
    "wrongDefinitions": [
      "exactly what \"worship the ground someone walks on\" sounds like",
      "to gain advantage",
      "to ignore a warning"
    ],
    "examples": [
      {
        "sentence": "(General American) IPA(key): (without the cot-caught merger) /-wɔks ɔn/."
      }
    ],
    "wrongExamples": [
      "worship ground someone walks on",
      "worship the ground someone walks in",
      "worship the ground someone walks",
      "He tried to worship the ground someone walks on but failed miserably.",
      "It takes practice to worship the ground someone walks on correctly."
    ]
  },
  {
    "id": "idiom_9579",
    "idiom": "worship the porcelain god",
    "definition": "To vomit into a toilet bowl.",
    "wrongDefinitions": [
      "exactly what \"worship the porcelain god\" sounds like",
      "to face challenges",
      "to delay an action"
    ],
    "examples": [
      {
        "sentence": "Synonyms: bow down before the porcelain god, drive the porcelain bus, pray to the porcelain god, worship the porcelain goddess; see also Thesaurus:regurgitate."
      }
    ],
    "wrongExamples": [
      "worship porcelain god",
      "worship the porcelain",
      "They forgot to worship the porcelain god before leaving.",
      "Can you teach me to worship the porcelain god?",
      "It takes practice to worship the porcelain god correctly."
    ]
  },
  {
    "id": "idiom_958",
    "idiom": "break one's duck",
    "definition": "To score one's first run in an innings.",
    "wrongDefinitions": [
      "to shatter one's duck",
      "a beneficial outcome",
      "demonstrating skill"
    ],
    "examples": [
      {
        "sentence": "Best had come on as a substitute in the 1-0 win at Wigan last weekend and wasted a goalscoring opportunity after stumbling as he was about to shoot, so many of the fans in black and white could have been forgiven for thinking that perhaps the burly forward was destined not to break his duck.",
        "usedIdiom": "break his duck"
      }
    ],
    "wrongExamples": [
      "broke one's duck",
      "They forgot to break one's duck before leaving.",
      "She learned to break one's duck at school.",
      "Everyone should break one's duck at least once.",
      "Can you teach me to break one's duck?"
    ],
    "context": "UK"
  },
  {
    "id": "idiom_9581",
    "idiom": "worst comes to worst",
    "definition": "If a possible worst-case scenario actually occurs.",
    "wrongDefinitions": [
      "a literal worst comes to worst",
      "to avoid responsibility",
      "lacking preparation"
    ],
    "examples": [
      {
        "sentence": "\"Worst comes to worst, we'll make it to Cleveland and we can set down there and wait things out.\" Gordon Rand nearly sneered, \"Worst comes to worst? We'll crash and die, isn't that closer to the worst end of the possibility spectrum?"
      },
      {
        "sentence": "You aren't doing anything anyway. Worst comes to worst you can give her some money and send her on her way."
      },
      {
        "sentence": "Worst comes to worst ...\" Eddie finished it. \"Worst comes to worst, we try Dr. One's patented homemade miracle vaccine. Stops hair loss. Stops gout. Builds muscles. Kills flus.\"."
      }
    ],
    "wrongExamples": [
      "She lost her worst comes to worst last week.",
      "Where can I find a good worst comes to worst?",
      "She collected several worst comes to worsts for her hobby.",
      "This worst comes to worst is made of plastic.",
      "My friend owns three worst comes to worsts."
    ]
  },
  {
    "id": "idiom_9582",
    "idiom": "worst-kept secret",
    "definition": "A situation where little or no attempt has been made to keep a matter secret.",
    "wrongDefinitions": [
      "a literal worst-kept secret",
      "to cause problems",
      "to hurry through something"
    ],
    "examples": [
      {
        "sentence": "Late last year, the first test train ran on the line - a Class 165 diesel multiple unit provided by Chiltern Railways. It provided yet another clear indication to what seems to be one of the worst-kept secrets on the railways - that Chiltern will be the operator of EWR services."
      }
    ],
    "wrongExamples": [
      "She lost her worst-kept secret last week.",
      "This worst-kept secret is made of plastic.",
      "My friend owns three worst-kept secrets.",
      "That worst-kept secret looks brand new.",
      "She collected several worst-kept secrets for her hobby."
    ]
  },
  {
    "id": "idiom_9583",
    "idiom": "worst of both worlds",
    "definition": "A solution or scenario which combines the disadvantages of two opposed prior solutions, often having been intended to combine their benefits instead.",
    "wrongDefinitions": [
      "a literal worst of both worlds",
      "to cause problems",
      "to repeat an error"
    ],
    "examples": [
      {
        "sentence": "Antonym: best of both worlds."
      },
      {
        "sentence": "The Worst of Both Worlds: Violating Rights without Gaining Security."
      },
      {
        "sentence": "Mandarin: please add this translation if you can."
      }
    ],
    "wrongExamples": [
      "I've never seen a worst of both worlds like that before.",
      "She lost her worst of both worlds last week.",
      "That worst of both worlds looks brand new.",
      "The worst of both worlds was on sale yesterday.",
      "He bought a worst of both worlds at the store."
    ]
  },
  {
    "id": "idiom_9584",
    "idiom": "worth a Jew's eye",
    "definition": "Of high value.",
    "wrongDefinitions": [
      "a literal worth a jew's eye",
      "to achieve success",
      "to attempt unsuccessfully"
    ],
    "examples": [
      {
        "sentence": "Lord love you, I'd swear it was worth a Jew's eye. Indeed, no money can compensate me for its loss."
      }
    ],
    "wrongExamples": [
      "She collected several worth a jew's eyes for her hobby.",
      "That worth a jew's eye looks brand new.",
      "My friend owns three worth a jew's eyes.",
      "The price of worth a jew's eyes has gone up.",
      "Where can I find a good worth a jew's eye?"
    ]
  },
  {
    "id": "idiom_9585",
    "idiom": "worth every penny",
    "definition": "Completely worth the money paid for it.",
    "wrongDefinitions": [
      "a literal worth every penny",
      "to gain advantage",
      "to repeat an error"
    ],
    "examples": [],
    "wrongExamples": [
      "She lost her worth every penny last week.",
      "She collected several worth every pennys for her hobby.",
      "This worth every penny is made of plastic.",
      "The worth every penny was on sale yesterday.",
      "He bought a worth every penny at the store."
    ]
  },
  {
    "id": "idiom_9586",
    "idiom": "worth one's salt",
    "definition": "Adept or competent, especially at one's occupation.",
    "wrongDefinitions": [
      "a literal worth one's salt",
      "to make things better",
      "to repeat an error"
    ],
    "examples": [
      {
        "sentence": "Any doctor worth their salt should be able to correctly diagnose the illness.",
        "usedIdiom": "worth their salt"
      },
      {
        "sentence": "[T]he encouragement for Shipwrights continues great at the Capital; to which all young People are naturally deſirous to come, whenever they fancy their abilities would diſtinguiſh them, or find a deſire to improve themſelves in their profeſſion; which two claſſes comprehend all the Shipwrights that will ever be worth their salt!",
        "usedIdiom": "worth their salt"
      },
      {
        "sentence": "Everyone who is worth his salt has his enemies, who must be beaten, be they evil thoughts and habits in himself, or spiritual wickedness in high places, or Russians, or Border-ruffians, or Bill, Tom, or Harry, who will not let him live his life in quiet till he has thrashed them.",
        "usedIdiom": "worth his salt"
      }
    ],
    "wrongExamples": [
      "That worth one's salt looks brand new.",
      "The price of worth one's salts has gone up.",
      "I've never seen a worth one's salt like that before.",
      "My friend owns three worth one's salts.",
      "The worth one's salt was on sale yesterday."
    ]
  },
  {
    "id": "idiom_9587",
    "idiom": "worth one's weight in gold",
    "definition": "Very valuable.",
    "wrongDefinitions": [
      "a literal worth one's weight in gold",
      "to face challenges",
      "demonstrating skill"
    ],
    "examples": [
      {
        "sentence": "I find my dog is worth her weight in gold on those long snowy weekends when I can't get out.",
        "usedIdiom": "worth her weight in gold"
      },
      {
        "sentence": "This book is worth its weight in gold to the housewife who wishes to feed her family for health-and economically.",
        "usedIdiom": "worth its weight in gold"
      }
    ],
    "wrongExamples": [
      "She lost her worth one's weight in gold last week.",
      "The price of worth one's weight in golds has gone up.",
      "The worth one's weight in gold was on sale yesterday.",
      "Where can I find a good worth one's weight in gold?",
      "I've never seen a worth one's weight in gold like that before."
    ]
  },
  {
    "id": "idiom_9588",
    "idiom": "worth one's while",
    "definition": "Beneficial and important enough on which to spend time, effort, or money.",
    "wrongDefinitions": [
      "a literal worth one's while",
      "to take charge",
      "remaining uncertain"
    ],
    "examples": [
      {
        "sentence": "Doing volunteer work to help others is truly worth one's while."
      },
      {
        "sentence": "Even if (2.3.5) holds, so that the worker's strategy is a best response to the firm's strategy, it must also be worth the firm's while to pay w ∗ {\\displaystyle w^{*}} ."
      }
    ],
    "wrongExamples": [
      "The price of worth one's whiles has gone up.",
      "He bought a worth one's while at the store.",
      "This worth one's while is made of plastic.",
      "Where can I find a good worth one's while?",
      "The worth one's while was on sale yesterday."
    ]
  },
  {
    "id": "idiom_9589",
    "idiom": "would give a Jew's eye",
    "definition": "Would give a great deal; indicating that one desires something greatly.",
    "wrongDefinitions": [
      "a literal would give a jew's eye",
      "to achieve success",
      "to celebrate prematurely"
    ],
    "examples": [
      {
        "sentence": "I'd give a Jew's eye for a handful of those apple blossoms-they are divine!"
      }
    ],
    "wrongExamples": [
      "She collected several would give a jew's eyes for her hobby.",
      "That would give a jew's eye looks brand new.",
      "Where can I find a good would give a jew's eye?",
      "The would give a jew's eye was on sale yesterday.",
      "He bought a would give a jew's eye at the store."
    ]
  },
  {
    "id": "idiom_959",
    "idiom": "break one's lance",
    "definition": "To engage in an honorable fight.",
    "wrongDefinitions": [
      "to shatter one's lance",
      "to cause problems",
      "to attempt unsuccessfully"
    ],
    "examples": [
      {
        "sentence": "Then you have Sweden, too, burning with desire to break a lance with Russia on the question of Polish independence."
      },
      {
        "sentence": "Inasmuch as our correspondent has such a poor opinion of the capacity of men to write understandingly and impartially upon feminine topics, we say to her and everybody else, \"The lists are open, ladies-hissez alia!\" We will be but as the heralds at the tourney, to sound the trumpets and preserve order. There is a fair field for our correspondent, whether she desires to break a lance with those detractors of her sex whom she so indignantly castigates, or only desires to set the world of fashion right as to the style of a bonnet."
      },
      {
        "sentence": "That is that you haven't broken your lance in any really major cause, that you haven't been actually out front and center on the really controversial issues. What is your comment on that criticism?"
      }
    ],
    "wrongExamples": [
      "broke one's lance",
      "The instructions said to break one's lance first thing in the morning.",
      "You should never break one's lance in public.",
      "They forgot to break one's lance before leaving.",
      "I always break one's lance on Mondays."
    ]
  },
  {
    "id": "idiom_9590",
    "idiom": "wouldn't be seen dead",
    "definition": "To find incredibly horrifying; embarrassing or otherwise entirely unsuitable for oneself.",
    "wrongDefinitions": [
      "exactly what \"wouldn't be seen dead\" sounds like",
      "a harmful practice",
      "to ignore a warning"
    ],
    "examples": [
      {
        "sentence": "I really don't want to buy anything. You seem by bad luck to be stocked up with just the sort of things I wouldn't be seen dead in a ditch with. I can't stand rubber rings, never could. I'm not really keen on buttonhooks."
      },
      {
        "sentence": "He'd seen an item about the resort on TV, though he couldn't remember whether it had been Tomorrow's World, Holiday or Eurotrash. What he could remember was swearing he wouldn't be seen dead in the place."
      }
    ],
    "wrongExamples": [
      "wouldn't be seen",
      "He tried to wouldn't be seen dead but failed miserably.",
      "She learned to wouldn't be seen dead at school.",
      "It takes practice to wouldn't be seen dead correctly.",
      "Can you teach me to wouldn't be seen dead?"
    ],
    "context": "UK"
  },
  {
    "id": "idiom_9591",
    "idiom": "wouldn't shout if a shark bit him",
    "definition": "To be frugal or miserly.",
    "wrongDefinitions": [
      "exactly what \"wouldn't shout if a shark bit him\" sounds like",
      "an unnecessary action",
      "appearing foolish"
    ],
    "examples": [
      {
        "sentence": "Yeah, he's as silly as a two-bob watch. And mean. He wouldn't shout [buy a drink] if a shark bit him.' 'Too right, he's got snakes in his pockets. Anyhow, how's the punting?' 'No luck, mate. [...]."
      },
      {
        "sentence": "Must be Martin's shout,' says one of them. The others roar with laughter. It's always Martin's shout but he's never there when you need him. 'Martin wouldn't shout if a shark bit him,' Harry explains to the tourist, filling up his glass."
      },
      {
        "sentence": "Weasel was noted for the outlandish stories of his sexual and other exploits in Australia and the Philippines. No one believed him and he was generally considered a pain in the arse. To make matters worse he was known to have a \"death adder\" in his pocket. \"Wouldn't shout if a shark bit him\", was the general opinion."
      }
    ],
    "wrongExamples": [
      "wouldn't shout if shark bit him",
      "wouldn't shout if a shark bit",
      "I always wouldn't shout if a shark bit him on Mondays.",
      "He tried to wouldn't shout if a shark bit him but failed miserably.",
      "She learned to wouldn't shout if a shark bit him at school."
    ]
  },
  {
    "id": "idiom_9592",
    "idiom": "wouldn't you know",
    "definition": "Alternative form of wouldn't you know it.",
    "wrongDefinitions": [
      "a literal wouldn't you know",
      "to take charge",
      "being overly cautious"
    ],
    "examples": [],
    "wrongExamples": [
      "He bought a wouldn't you know at the store.",
      "My friend owns three wouldn't you knows.",
      "This wouldn't you know is made of plastic.",
      "The wouldn't you know was on sale yesterday.",
      "The price of wouldn't you knows has gone up."
    ]
  },
  {
    "id": "idiom_9593",
    "idiom": "wouldn't you say",
    "definition": "Don't you agree?",
    "wrongDefinitions": [
      "a literal wouldn't you say",
      "something done carelessly",
      "lacking preparation"
    ],
    "examples": [],
    "wrongExamples": [
      "The wouldn't you say was on sale yesterday.",
      "She lost her wouldn't you say last week.",
      "The price of wouldn't you says has gone up.",
      "That wouldn't you say looks brand new.",
      "This wouldn't you say is made of plastic."
    ]
  },
  {
    "id": "idiom_9594",
    "idiom": "wrack and ruin",
    "definition": "Complete destruction.",
    "wrongDefinitions": [
      "a literal wrack and ruin",
      "to show weakness",
      "to repeat an error"
    ],
    "examples": [
      {
        "sentence": "Whiles all things seeme to fall to wracke and ruine."
      }
    ],
    "wrongExamples": [
      "Where can I find a good wrack and ruin?",
      "He bought a wrack and ruin at the store.",
      "The wrack and ruin was on sale yesterday.",
      "She collected several wrack and ruins for her hobby.",
      "That wrack and ruin looks brand new."
    ]
  },
  {
    "id": "idiom_9595",
    "idiom": "wrap around one's little finger",
    "definition": "To successfully control or exert influence over, especially for a sustained period of time.",
    "wrongDefinitions": [
      "exactly what \"wrap around one's little finger\" sounds like",
      "an unnecessary action",
      "to hurry through something"
    ],
    "examples": [
      {
        "sentence": "She has all of them wrapped around her little finger. They'd do anything for her."
      }
    ],
    "wrongExamples": [
      "wrap around one's little",
      "I always wrap around one's little finger on Mondays.",
      "The manual shows how to wrap around one's little finger properly.",
      "It takes practice to wrap around one's little finger correctly.",
      "Everyone should wrap around one's little finger at least once."
    ]
  },
  {
    "id": "idiom_9596",
    "idiom": "wrap in cotton wool",
    "definition": "To treat delicately, to baby, to coddle.",
    "wrongDefinitions": [
      "exactly what \"wrap in cotton wool\" sounds like",
      "to show weakness",
      "to begin something reluctantly"
    ],
    "examples": [
      {
        "sentence": "A word to the wise-don't wrap him in cotton wool, because he'll resent it later."
      },
      {
        "sentence": "But you can't wrap me in cotton wool."
      },
      {
        "sentence": "All the Stuff the Expectant Dad Needs to Know George Lewis ... Because it must be hard,' that I even allowed myself to admit to myself that, yes, it was quite hard. ... But she didn't wrap him up in cotton wool and always tried to [...]."
      }
    ],
    "wrongExamples": [
      "wrap with cotton wool",
      "wrap in cotton",
      "It takes practice to wrap in cotton wool correctly.",
      "I always wrap in cotton wool on Mondays.",
      "She learned to wrap in cotton wool at school."
    ],
    "context": "UK"
  },
  {
    "id": "idiom_9597",
    "idiom": "wrap in the flag",
    "definition": "To claim as deserving support for patriotic reasons.",
    "wrongDefinitions": [
      "exactly what \"wrap in the flag\" sounds like",
      "to avoid responsibility",
      "to continue despite difficulty"
    ],
    "examples": [
      {
        "sentence": "Both parties wrap themselves in the flag every election."
      },
      {
        "sentence": "He manages to wrap every bit of pork for his district in the flag."
      }
    ],
    "wrongExamples": [
      "wrap in flag",
      "wrap in the",
      "She learned to wrap in the flag at school.",
      "You should never wrap in the flag in public.",
      "Everyone should wrap in the flag at least once."
    ]
  },
  {
    "id": "idiom_9598",
    "idiom": "wrap up",
    "definition": "To cover or enclose (something) by folding and securing a covering entirely around it.",
    "wrongDefinitions": [
      "exactly what \"wrap up\" sounds like",
      "an unnecessary action",
      "demonstrating skill"
    ],
    "examples": [
      {
        "sentence": "He wrapped up the parcel with brown paper."
      },
      {
        "sentence": "Let me wrap you up a piece of this pie to take home with you."
      },
      {
        "sentence": "After all the fish were wrapped up, into the office we went to make the entry into the record book."
      }
    ],
    "wrongExamples": [
      "She learned to wrap up at school.",
      "It takes practice to wrap up correctly.",
      "The instructions said to wrap up first thing in the morning.",
      "I always wrap up on Mondays.",
      "The manual shows how to wrap up properly."
    ]
  },
  {
    "id": "idiom_9599",
    "idiom": "wrestle with a pig",
    "definition": "To engage in a struggle with an opponent that benefits from the struggle even without winning it.",
    "wrongDefinitions": [
      "exactly what \"wrestle with a pig\" sounds like",
      "a harmful practice",
      "to delay an action"
    ],
    "examples": [
      {
        "sentence": "And when you begin refuting one another's reasons, fussing back and forth, you generally do what a nationally known industrial relations authority warns you against: you wallow in the mud with the pig. He says, 'Never wallow in the mud with a pig, because the pig likes it.' That is exactly what he wants, because you are on his home ground. He can think of arguments as well as you can, so where do you come out?"
      },
      {
        "sentence": "'I learned long ago never to wrestle with a pig,' Ching likes to say, 'You get dirty and besides the pig likes it.'."
      },
      {
        "sentence": "While I was at the Dartmouth Review, we used to tell the deans that taking on our campus paper was like wrestling with a pig. Not only did it get everyone dirty, but the pig liked it!"
      }
    ],
    "wrongExamples": [
      "wrestle with pig",
      "wrestle on a pig",
      "wrestle with a",
      "She learned to wrestle with a pig at school.",
      "It takes practice to wrestle with a pig correctly."
    ]
  },
  {
    "id": "idiom_960",
    "idiom": "break one's neck",
    "definition": "To make extraordinary efforts to achieve an end; to exert oneself in pursuit of a goal.",
    "wrongDefinitions": [
      "to shatter one's neck",
      "to take charge",
      "lacking preparation"
    ],
    "examples": [
      {
        "sentence": "Synonyms: break one's back, (vulgar) bust one's ass, (vulgar) work one's ass off."
      }
    ],
    "wrongExamples": [
      "broke one's neck",
      "Can you teach me to break one's neck?",
      "I always break one's neck on Mondays.",
      "They forgot to break one's neck before leaving.",
      "The manual shows how to break one's neck properly."
    ]
  },
  {
    "id": "idiom_9600",
    "idiom": "wrist-slap",
    "definition": "To reprimand mildly.",
    "wrongDefinitions": [
      "exactly what \"wrist-slap\" sounds like",
      "an unnecessary action",
      "lacking preparation"
    ],
    "examples": [
      {
        "sentence": "You know the mother will probably only wrist-slap her \"little angel\" with a tsk-tsk. No wonder the kid is a little terror."
      },
      {
        "sentence": "Some crimes clearly warrant more than a mere wrist-slap - physically dangerous people must be removed from circulation."
      }
    ],
    "wrongExamples": [
      "They forgot to wrist-slap before leaving.",
      "Everyone should wrist-slap at least once.",
      "You should never wrist-slap in public.",
      "Can you teach me to wrist-slap?",
      "I always wrist-slap on Mondays."
    ]
  },
  {
    "id": "idiom_9601",
    "idiom": "write checks one can't cash",
    "definition": "To make promises one cannot keep, or to make boasts that are not true.",
    "wrongDefinitions": [
      "exactly what \"write checks one can't cash\" sounds like",
      "a harmful practice",
      "to ignore a warning"
    ],
    "examples": [
      {
        "sentence": "You're acting like a frat boy, which is fun and all, but you're writing checks you can't cash."
      },
      {
        "sentence": "\"I think your mouth might be writing checks you can't cash.\"."
      }
    ],
    "wrongExamples": [
      "write checks one can't",
      "She learned to write checks one can't cash at school.",
      "The instructions said to write checks one can't cash first thing in the morning.",
      "Everyone should write checks one can't cash at least once.",
      "They forgot to write checks one can't cash before leaving."
    ]
  },
  {
    "id": "idiom_9602",
    "idiom": "write for the drawer",
    "definition": "To write a work for posterity or for friends that one cannot publish except as samizdat.",
    "wrongDefinitions": [
      "exactly what \"write for the drawer\" sounds like",
      "an unnecessary action",
      "demonstrating skill"
    ],
    "examples": [
      {
        "sentence": "It was a middle-aged intellectual crowd. Publishers who abandoned their writers, writers who wrote for the drawer, artists who had become wealthy by turning Social Realism into kitsch.",
        "usedIdiom": "wrote for the drawer"
      },
      {
        "sentence": "It seemed suddenly miraculous that she was here, in America, holding in her hands a book that she had written for the drawer four years earlier in Moscow.",
        "usedIdiom": "written for the drawer"
      },
      {
        "sentence": "Since I first began to write I had to write for the drawer."
      }
    ],
    "wrongExamples": [
      "write for drawer",
      "write for the",
      "The instructions said to write for the drawer first thing in the morning.",
      "They forgot to write for the drawer before leaving.",
      "She learned to write for the drawer at school."
    ]
  },
  {
    "id": "idiom_9603",
    "idiom": "write oneself into a corner",
    "definition": "To reach a narrative point in which the story one is writing gets stuck, leaving no good or satisfactory alternative or resolution. [from 19th c.].",
    "wrongDefinitions": [
      "exactly what \"write oneself into a corner\" sounds like",
      "to take charge",
      "to celebrate prematurely"
    ],
    "examples": [
      {
        "sentence": "When Rudyard Kipling wrote the words, \"That belongs to another story,\" he conferred upon scribbling mankind an inestimabie blessing. How we ever got along without the accommodating little sentence, I don't know, but it has evidently come to stay. You write yourself \"into a corner,\" and see no way out of it except to tear up the sheet and begin over, when-Presto! \"That belongs to another story\" pops into your head and your awkward sentence is gracefully capped."
      }
    ],
    "wrongExamples": [
      "write oneself into corner",
      "write oneself into a",
      "He tried to write oneself into a corner but failed miserably.",
      "The instructions said to write oneself into a corner first thing in the morning.",
      "Everyone should write oneself into a corner at least once."
    ]
  },
  {
    "id": "idiom_9604",
    "idiom": "write one's own ticket",
    "definition": "To be empowered to choose whichever job, financial arrangement, or course of action one desires.",
    "wrongDefinitions": [
      "exactly what \"write one's own ticket\" sounds like",
      "to show weakness",
      "showing poor judgment"
    ],
    "examples": [
      {
        "sentence": "Mr. DeChadenedes said that any one wishing to back the Republican candidate could write his own ticket and name his own price.",
        "usedIdiom": "write his own ticket"
      },
      {
        "sentence": "Parker figured that in the interim, the record companies would sell out their stock of Elvis' recordings, and that the King could write his own ticket when he returned, in both the recording and the film industries. Parker was right.",
        "usedIdiom": "write his own ticket"
      }
    ],
    "wrongExamples": [
      "write one's own",
      "They forgot to write one's own ticket before leaving.",
      "I always write one's own ticket on Mondays.",
      "He tried to write one's own ticket but failed miserably.",
      "The instructions said to write one's own ticket first thing in the morning."
    ]
  },
  {
    "id": "idiom_9605",
    "idiom": "writer's cramp",
    "definition": "A debilitating pain preventing easy movement of the wrist, hand, or fingers, resulting from prolonged use of a pen or pencil.",
    "wrongDefinitions": [
      "a literal writer's cramp",
      "to face challenges",
      "demonstrating skill"
    ],
    "examples": [
      {
        "sentence": "The recording of their tales is no more than a matter of ears and fingers. There are only two fates I dread-deafness and writer's cramp."
      },
      {
        "sentence": "The following boys will go in to extra lesson this afternoon and next Wednesday,\" it began. And \"the following boys\" numbered four hundred.\"Bates must have got writer's cramp,\" said Clowes, as he read the huge scroll."
      },
      {
        "sentence": "Christmas dividend checks and checks covering Christmas presents to his employees were always signed by him. . . . He had writer's cramp by the time he finished."
      }
    ],
    "wrongExamples": [
      "That writer's cramp looks brand new.",
      "She collected several writer's cramps for her hobby.",
      "The writer's cramp was on sale yesterday.",
      "This writer's cramp is made of plastic.",
      "I've never seen a writer's cramp like that before."
    ]
  },
  {
    "id": "idiom_9606",
    "idiom": "write the book",
    "definition": "To be an authoritative expert on some specified topic.",
    "wrongDefinitions": [
      "exactly what \"write the book\" sounds like",
      "to lose control",
      "to finish something completely"
    ],
    "examples": [
      {
        "sentence": "Do I know how to play chess? I wrote the book on it!",
        "usedIdiom": "wrote the book"
      }
    ],
    "wrongExamples": [
      "write book",
      "They forgot to write the book before leaving.",
      "Can you teach me to write the book?",
      "The instructions said to write the book first thing in the morning.",
      "It takes practice to write the book correctly."
    ]
  },
  {
    "id": "idiom_9607",
    "idiom": "writing on the wall",
    "definition": "An ominous warning; a prediction of bad luck.",
    "wrongDefinitions": [
      "a literal writing on the wall",
      "a common mistake",
      "to continue despite difficulty"
    ],
    "examples": [
      {
        "sentence": "He could see the writing on the wall months before the business failed."
      },
      {
        "sentence": "However, regardless of evil portents, prophetic despair and a great deal too much writing on the wall, I have managed so far to write two fairly cheerful musical comedies."
      },
      {
        "sentence": "The Portuguese refused to read the writings on the wall and clung to their colonies, including the one in India."
      }
    ],
    "wrongExamples": [
      "She lost her writing on the wall last week.",
      "She collected several writing on the walls for her hobby.",
      "Where can I find a good writing on the wall?",
      "The writing on the wall was on sale yesterday.",
      "The price of writing on the walls has gone up."
    ]
  },
  {
    "id": "idiom_9608",
    "idiom": "written all over someone's face",
    "definition": "Very obvious, from someone's facial expression.",
    "wrongDefinitions": [
      "a literal written all over someone's face",
      "a common mistake",
      "remaining uncertain"
    ],
    "examples": [],
    "wrongExamples": [
      "This written all over someone's face is made of plastic.",
      "My friend owns three written all over someone's faces.",
      "I've never seen a written all over someone's face like that before.",
      "That written all over someone's face looks brand new.",
      "She collected several written all over someone's faces for her hobby."
    ]
  },
  {
    "id": "idiom_9609",
    "idiom": "written in the stars",
    "definition": "Destined to happen, fated to happen.",
    "wrongDefinitions": [
      "a literal written in the stars",
      "to show weakness",
      "being overly cautious"
    ],
    "examples": [
      {
        "sentence": "In the end it felt as if it was written in the stars. Every 12 years South Africa have an unerring habit of winning World Cups and they have done so again, following up their triumphs of 1995 and 2007 with another prodigious display of power and might."
      }
    ],
    "wrongExamples": [
      "He bought a written in the stars at the store.",
      "The price of written in the starss has gone up.",
      "The written in the stars was on sale yesterday.",
      "She collected several written in the starss for her hobby.",
      "Where can I find a good written in the stars?"
    ]
  },
  {
    "id": "idiom_961",
    "idiom": "break out",
    "definition": "To escape, especially forcefully or defiantly.",
    "wrongDefinitions": [
      "to shatter out",
      "a common mistake",
      "to begin something reluctantly"
    ],
    "examples": [
      {
        "sentence": "They broke out of prison in the middle of the night.",
        "usedIdiom": "broke out"
      },
      {
        "sentence": "The brigade succeeded in breaking out of the pocket and reunited with friendly forces.",
        "usedIdiom": "breaking out"
      },
      {
        "sentence": "After Big Tony was sent to prison, his friends got together to break him out."
      }
    ],
    "wrongExamples": [
      "broke out",
      "He tried to break out but failed miserably.",
      "I always break out on Mondays.",
      "She learned to break out at school.",
      "They forgot to break out before leaving."
    ]
  },
  {
    "id": "idiom_9610",
    "idiom": "wrong crowd",
    "definition": "A group of people deemed to have a negative influence on a person's behavior; a bad crowd.",
    "wrongDefinitions": [
      "a literal wrong crowd",
      "to create confusion",
      "experiencing confusion"
    ],
    "examples": [
      {
        "sentence": "To fall in with the wrong crowd."
      },
      {
        "sentence": "To hang out with the wrong crowd."
      },
      {
        "sentence": "Jimmy's mother was concerned that he might have fallen in with the wrong crowd."
      }
    ],
    "wrongExamples": [
      "Where can I find a good wrong crowd?",
      "My friend owns three wrong crowds.",
      "This wrong crowd is made of plastic.",
      "The price of wrong crowds has gone up.",
      "I've never seen a wrong crowd like that before."
    ]
  },
  {
    "id": "idiom_9611",
    "idiom": "wrong number",
    "definition": "A telephone number dialled by mistake, for example, by transposing digits.",
    "wrongDefinitions": [
      "a literal wrong number",
      "to achieve success",
      "to prepare for something"
    ],
    "examples": [
      {
        "sentence": "- Who was that on the phone? - It was just a wrong number."
      },
      {
        "sentence": "Codd said . . . when he had her fixed and tested her a few times he would take me up for a ride.\"You got the wrong number,\" I says. \"I don't feel flighty."
      },
      {
        "sentence": "His musical system, like the political system he served, would rescue the present moment from crisis and place it at last in productive harmony with history's demands. Boy, did he have the wrong number."
      }
    ],
    "wrongExamples": [
      "She collected several wrong numbers for her hobby.",
      "This wrong number is made of plastic.",
      "The wrong number was on sale yesterday.",
      "The price of wrong numbers has gone up.",
      "That wrong number looks brand new."
    ]
  },
  {
    "id": "idiom_9612",
    "idiom": "wrong side of the tracks",
    "definition": "The part of town that is not inhabited by the wealthy. An area where the working class, poor or extremely poor live.",
    "wrongDefinitions": [
      "a literal wrong side of the tracks",
      "a beneficial outcome",
      "to celebrate prematurely"
    ],
    "examples": [
      {
        "sentence": "He grew up on the wrong side of the tracks, but he made a success of himself."
      },
      {
        "sentence": "An arc electric light has been put toward the north side of the depot, [...] As one gentleman expressed it, the people can more quickly see that they are on the \"wrong side of the track."
      },
      {
        "sentence": "\"Can you come over to the wrong side of the tracks?\" she asked, an amused dryness underscoring the delivery of that question. \"Always.\" \"I was, of course, referring to geographical matters. You live in the more chic part of Kreuzberg.\"."
      }
    ],
    "wrongExamples": [
      "That wrong side of the tracks looks brand new.",
      "He bought a wrong side of the tracks at the store.",
      "She collected several wrong side of the trackss for her hobby.",
      "My friend owns three wrong side of the trackss.",
      "The wrong side of the tracks was on sale yesterday."
    ]
  },
  {
    "id": "idiom_9613",
    "idiom": "X factor",
    "definition": "An unknown or hard-to-define influence; a factor with unknown or unforeseeable consequences.",
    "wrongDefinitions": [
      "a literal x factor",
      "something done carelessly",
      "to prepare for something"
    ],
    "examples": [
      {
        "sentence": "We slid into our office, past two women discussing the \"X factor,\" an apparently undefined quality their firm felt they lacked."
      },
      {
        "sentence": "The map can be misleading. It can appear to contain all the relevant information, but in real life, there is always an X factor."
      },
      {
        "sentence": "And put him on an LA film set and he glowed with that indefinable X-factor that agents the world over wished they could bottle."
      }
    ],
    "wrongExamples": [
      "She lost her x factor last week.",
      "He bought a x factor at the store.",
      "This x factor is made of plastic.",
      "The x factor was on sale yesterday.",
      "My friend owns three x factors."
    ]
  },
  {
    "id": "idiom_9614",
    "idiom": "X marks the spot",
    "definition": "One will find what one is looking for under an obvious sign for it.",
    "wrongDefinitions": [
      "a literal x marks the spot",
      "to take charge",
      "having excessive pride"
    ],
    "examples": [],
    "wrongExamples": [
      "That x marks the spot looks brand new.",
      "The x marks the spot was on sale yesterday.",
      "This x marks the spot is made of plastic.",
      "The price of x marks the spots has gone up.",
      "I've never seen a x marks the spot like that before."
    ]
  },
  {
    "id": "idiom_9615",
    "idiom": "X's and O's",
    "definition": "Tic-tac-toe.",
    "wrongDefinitions": [
      "a literal x's and o's",
      "an unnecessary action",
      "to hurry through something"
    ],
    "examples": [
      {
        "sentence": "Against one wall they had three chickens in three different cages with electric X's and O's to play X's and O's with the chicken. You insert 25 cents and the chicken would peck at an X. It was impossible to beat the chicken, because there was an electrical shock that made the chicken hit the right button."
      },
      {
        "sentence": "Before we can explore computer play at chess, let's start with a much simpler game: the game of tic-tac-toe (also called noughts and crosses, Xs and Os, or exy-ozys). This game is one of the first games that many kids learn."
      },
      {
        "sentence": "Tic Tac Toe has many names in other countries- it is called \"Kata Kuti\" in the Eastern part of India, \"Exy."
      }
    ],
    "wrongExamples": [
      "That x's and o's looks brand new.",
      "Where can I find a good x's and o's?",
      "She collected several x's and o'ss for her hobby.",
      "This x's and o's is made of plastic.",
      "The x's and o's was on sale yesterday."
    ]
  },
  {
    "id": "idiom_9616",
    "idiom": "yank someone's chain",
    "definition": "To tease someone; to lead someone on; to goad someone into overreacting.",
    "wrongDefinitions": [
      "exactly what \"yank someone's chain\" sounds like",
      "to show weakness",
      "having excessive pride"
    ],
    "examples": [
      {
        "sentence": "So, be careful what you are paying attention to. If it looks like someone is yanking your chain, he or she probably is."
      },
      {
        "sentence": "\"For the same reason you were yanking my chain about the double ropes,\" I said. \"You want to see if I'm going to be any help to you or a total idiot when it comes to this retail thing.\"."
      },
      {
        "sentence": "It was so easy to yank his chain, Tiree smirked to herself, as she dialled Les's London flat."
      }
    ],
    "wrongExamples": [
      "Can you teach me to yank someone's chain?",
      "I always yank someone's chain on Mondays.",
      "They forgot to yank someone's chain before leaving.",
      "Everyone should yank someone's chain at least once.",
      "It takes practice to yank someone's chain correctly."
    ]
  },
  {
    "id": "idiom_9617",
    "idiom": "yardarm it",
    "definition": "To begin to drink alcohol once it is late enough in the day.",
    "wrongDefinitions": [
      "exactly what \"yardarm it\" sounds like",
      "something done carelessly",
      "to continue despite difficulty"
    ],
    "examples": [],
    "wrongExamples": [
      "You should never yardarm it in public.",
      "She learned to yardarm it at school.",
      "Everyone should yardarm it at least once.",
      "The manual shows how to yardarm it properly.",
      "I always yardarm it on Mondays."
    ]
  },
  {
    "id": "idiom_9618",
    "idiom": "yardarm to",
    "definition": "Very close to, very nearby.",
    "wrongDefinitions": [
      "a literal yardarm to",
      "a common mistake",
      "remaining uncertain"
    ],
    "examples": [],
    "wrongExamples": [
      "The yardarm to was on sale yesterday.",
      "My friend owns three yardarm tos.",
      "That yardarm to looks brand new.",
      "She lost her yardarm to last week.",
      "The price of yardarm tos has gone up."
    ]
  },
  {
    "id": "idiom_9619",
    "idiom": "yardarm to yardarm",
    "definition": "Very close to each other.",
    "wrongDefinitions": [
      "a literal yardarm to yardarm",
      "to face challenges",
      "to celebrate prematurely"
    ],
    "examples": [],
    "wrongExamples": [
      "I've never seen a yardarm to yardarm like that before.",
      "That yardarm to yardarm looks brand new.",
      "She collected several yardarm to yardarms for her hobby.",
      "The price of yardarm to yardarms has gone up.",
      "The yardarm to yardarm was on sale yesterday."
    ]
  },
  {
    "id": "idiom_962",
    "idiom": "break ranks",
    "definition": "To march or charge out of the designated order in a military unit.",
    "wrongDefinitions": [
      "to shatter ranks",
      "an unnecessary action",
      "to celebrate prematurely"
    ],
    "examples": [
      {
        "sentence": "Coordinate term: keep rank."
      },
      {
        "sentence": "Mandarin: 打亂隊形 / 打乱队形 (dǎluàn duìxíng), 擅自行動 / 擅自行动 (shànzì xíngdòng)."
      }
    ],
    "wrongExamples": [
      "broke ranks",
      "I always break ranks on Mondays.",
      "The manual shows how to break ranks properly.",
      "It takes practice to break ranks correctly.",
      "They forgot to break ranks before leaving."
    ]
  },
  {
    "id": "idiom_9620",
    "idiom": "yarn-spinner",
    "definition": "One who spins yarns, a storyteller.",
    "wrongDefinitions": [
      "a literal yarn-spinner",
      "to achieve success",
      "showing poor judgment"
    ],
    "examples": [],
    "wrongExamples": [
      "The yarn-spinner was on sale yesterday.",
      "She collected several yarn-spinners for her hobby.",
      "That yarn-spinner looks brand new.",
      "My friend owns three yarn-spinners.",
      "I've never seen a yarn-spinner like that before."
    ]
  },
  {
    "id": "idiom_9621",
    "idiom": "yeah, yeah",
    "definition": "A sarcastic expression of disbelief.",
    "wrongDefinitions": [
      "a literal yeah, yeah",
      "a common mistake",
      "remaining uncertain"
    ],
    "examples": [],
    "wrongExamples": [
      "That yeah, yeah looks brand new.",
      "She collected several yeah, yeahs for her hobby.",
      "This yeah, yeah is made of plastic.",
      "The yeah, yeah was on sale yesterday.",
      "He bought a yeah, yeah at the store."
    ]
  },
  {
    "id": "idiom_9622",
    "idiom": "year dot",
    "definition": "A very long time ago, from the beginning or as far back as one can remember.",
    "wrongDefinitions": [
      "a literal year dot",
      "to gain advantage",
      "to prepare for something"
    ],
    "examples": [
      {
        "sentence": "That hat dates from the year dot."
      },
      {
        "sentence": "Disk interfaces have been around since the year dot, as people soon realised that the microdrive was unreliable, unstable and generally rubbish for the storage of anything, useless except as a rather small beermat."
      }
    ],
    "wrongExamples": [
      "Where can I find a good year dot?",
      "She lost her year dot last week.",
      "The year dot was on sale yesterday.",
      "My friend owns three year dots.",
      "The price of year dots has gone up."
    ],
    "context": "UK"
  },
  {
    "id": "idiom_9623",
    "idiom": "year in, year out",
    "definition": "During every year; always.",
    "wrongDefinitions": [
      "a literal year in, year out",
      "a harmful practice",
      "lacking preparation"
    ],
    "examples": [
      {
        "sentence": "Mandarin: 年復一年 / 年复一年 (zh) (niánfùyīnián), 年年 (zh) (niánnián)."
      }
    ],
    "wrongExamples": [
      "He bought a year in, year out at the store.",
      "That year in, year out looks brand new.",
      "She lost her year in, year out last week.",
      "The year in, year out was on sale yesterday.",
      "The price of year in, year outs has gone up."
    ]
  },
  {
    "id": "idiom_9624",
    "idiom": "ye gods",
    "definition": "Used to express surprise or incredulity.",
    "wrongDefinitions": [
      "a literal ye gods",
      "a beneficial outcome",
      "to repeat an error"
    ],
    "examples": [
      {
        "sentence": "Ye Gods, what Havock does Ambition makeAmong your Works!"
      },
      {
        "sentence": "Would he not far rather lay him down lengthwise along the line of the equator; yea, ye gods! go down to the fiery pit itself, in order to keep out this frost?"
      }
    ],
    "wrongExamples": [
      "He bought a ye gods at the store.",
      "That ye gods looks brand new.",
      "My friend owns three ye godss.",
      "The ye gods was on sale yesterday.",
      "She collected several ye godss for her hobby."
    ]
  },
  {
    "id": "idiom_9625",
    "idiom": "yell at",
    "definition": "To scold, to rebuke, often by yelling.",
    "wrongDefinitions": [
      "exactly what \"yell at\" sounds like",
      "a harmful practice",
      "to prepare for something"
    ],
    "examples": [
      {
        "sentence": "The boy's father yelled at him for lying to him about cleaning up the mess."
      }
    ],
    "wrongExamples": [
      "yell with",
      "It takes practice to yell at correctly.",
      "Can you teach me to yell at?",
      "You should never yell at in public.",
      "He tried to yell at but failed miserably."
    ]
  },
  {
    "id": "idiom_9626",
    "idiom": "yellow-bellied",
    "definition": "Of an animal or reptile; having a yellow underside or belly.",
    "wrongDefinitions": [
      "a literal yellow-bellied",
      "to create confusion",
      "to celebrate prematurely"
    ],
    "examples": [],
    "wrongExamples": [
      "She collected several yellow-bellieds for her hobby.",
      "This yellow-bellied is made of plastic.",
      "The yellow-bellied was on sale yesterday.",
      "Where can I find a good yellow-bellied?",
      "My friend owns three yellow-bellieds."
    ]
  },
  {
    "id": "idiom_9627",
    "idiom": "yellow brick road",
    "definition": "A proverbial path to a Promised Land of one's hopes and dreams.",
    "wrongDefinitions": [
      "a literal yellow brick road",
      "to lose control",
      "to begin something reluctantly"
    ],
    "examples": [
      {
        "sentence": "But we're coming up on a bend in the yellow brick road, and going 'round it could cause the party lights to go dark quickly."
      },
      {
        "sentence": "But for Clinton the yellow brick road that led inevitably to the Democratic nomination has suddenly become a little bumpy."
      },
      {
        "sentence": "Smash the emergency glass, press the big red button and just STOP. Step off the Yellow Brick Road, get mixed up with some flying monkeys and throw yourself into all manner of trouble. Trust me. IT'S YOUR LAST CHANCE."
      }
    ],
    "wrongExamples": [
      "He bought a yellow brick road at the store.",
      "She collected several yellow brick roads for her hobby.",
      "The price of yellow brick roads has gone up.",
      "She lost her yellow brick road last week.",
      "The yellow brick road was on sale yesterday."
    ]
  },
  {
    "id": "idiom_9628",
    "idiom": "yellow grease",
    "definition": "Used vegetable oil purposed for use as biodiesel.",
    "wrongDefinitions": [
      "a literal yellow grease",
      "to show weakness",
      "to attempt unsuccessfully"
    ],
    "examples": [
      {
        "sentence": "Using waste oil can be much less problematic, but in the US, waste oil is sold by rendering companies as yellow grease, and to a certain extent yellow grease is a substitute for fresh oil."
      }
    ],
    "wrongExamples": [
      "She collected several yellow greases for her hobby.",
      "The price of yellow greases has gone up.",
      "He bought a yellow grease at the store.",
      "I've never seen a yellow grease like that before.",
      "My friend owns three yellow greases."
    ]
  },
  {
    "id": "idiom_9629",
    "idiom": "yellow journalism",
    "definition": "Journalism which is sensationalistic and of questionable accuracy and taste.",
    "wrongDefinitions": [
      "a literal yellow journalism",
      "an unnecessary action",
      "to begin something reluctantly"
    ],
    "examples": [
      {
        "sentence": "It is the sort of paper which the father of the family is expected to take home with him from his office and read aloud to the chicks before bed-time. It was founded by its proprietor, Mr. Benjamin White, as an antidote to yellow journalism."
      },
      {
        "sentence": "In the heyday of yellow journalism, newspapers like Joseph Pulitzer's World and William Randolph Hearst's New York Journal sent out squads of reporters to hunt down leads and, if evidence failed to materialize, make up stories."
      }
    ],
    "wrongExamples": [
      "Where can I find a good yellow journalism?",
      "The yellow journalism was on sale yesterday.",
      "The price of yellow journalisms has gone up.",
      "That yellow journalism looks brand new.",
      "He bought a yellow journalism at the store."
    ]
  },
  {
    "id": "idiom_963",
    "idiom": "break reality",
    "definition": "To reach or experience a nonordinary state of consciousness, especially when using psychedelics.",
    "wrongDefinitions": [
      "to shatter reality",
      "to make things better",
      "to continue despite difficulty"
    ],
    "examples": [
      {
        "sentence": "If you break reality too often you'll get bored of the effects."
      }
    ],
    "wrongExamples": [
      "broke reality",
      "Everyone should break reality at least once.",
      "You should never break reality in public.",
      "I always break reality on Mondays.",
      "It takes practice to break reality correctly."
    ]
  },
  {
    "id": "idiom_9630",
    "idiom": "yellow journalist",
    "definition": "A journalist who writes material which is sensationalistic and of questionable accuracy and taste.",
    "wrongDefinitions": [
      "a literal yellow journalist",
      "to cause problems",
      "to attempt unsuccessfully"
    ],
    "examples": [],
    "wrongExamples": [
      "The yellow journalist was on sale yesterday.",
      "Where can I find a good yellow journalist?",
      "My friend owns three yellow journalists.",
      "She collected several yellow journalists for her hobby.",
      "That yellow journalist looks brand new."
    ]
  },
  {
    "id": "idiom_9631",
    "idiom": "yellow light",
    "definition": "A traffic light, between the green light and the red light, indicating that vehicles should stop if safely possible.",
    "wrongDefinitions": [
      "a literal yellow light",
      "to cause problems",
      "being too confident"
    ],
    "examples": [
      {
        "sentence": "Cantonese: 黃燈 / 黄灯 (wong4 dang1)."
      }
    ],
    "wrongExamples": [
      "The yellow light was on sale yesterday.",
      "I've never seen a yellow light like that before.",
      "That yellow light looks brand new.",
      "She lost her yellow light last week.",
      "The price of yellow lights has gone up."
    ]
  },
  {
    "id": "idiom_9632",
    "idiom": "yellow press",
    "definition": "Newspapers which publish sensationalist articles rather than well researched and sober journalism.",
    "wrongDefinitions": [
      "a literal yellow press",
      "to create confusion",
      "to prepare for something"
    ],
    "examples": [
      {
        "sentence": "The Olivette incident has often been cited as emblematic of the distortions published by Hearst and the rest of the yellow press during the Cuban revolution, but it seems to have been founded in an honest mistake."
      }
    ],
    "wrongExamples": [
      "This yellow press is made of plastic.",
      "The yellow press was on sale yesterday.",
      "She collected several yellow presss for her hobby.",
      "The price of yellow presss has gone up.",
      "I've never seen a yellow press like that before."
    ]
  },
  {
    "id": "idiom_9633",
    "idiom": "yellow state",
    "definition": "A state of the United States where the Libertarian Party is influential.",
    "wrongDefinitions": [
      "a literal yellow state",
      "something done carelessly",
      "experiencing confusion"
    ],
    "examples": [],
    "wrongExamples": [
      "The yellow state was on sale yesterday.",
      "The price of yellow states has gone up.",
      "That yellow state looks brand new.",
      "Where can I find a good yellow state?",
      "This yellow state is made of plastic."
    ]
  },
  {
    "id": "idiom_9634",
    "idiom": "yell silently",
    "definition": "To think very strong thoughts that one wishes to yell out loud but does not.",
    "wrongDefinitions": [
      "exactly what \"yell silently\" sounds like",
      "a harmful practice",
      "to ignore a warning"
    ],
    "examples": [
      {
        "sentence": "He yelled silently at R. Daneel: Machine!"
      },
      {
        "sentence": "Shut up, he yelled silently as the woman cried out in pain and terror in the cabin behind him."
      },
      {
        "sentence": "Hurry, he yelled silently to the pilot. Hurry!"
      }
    ],
    "wrongExamples": [
      "Can you teach me to yell silently?",
      "It takes practice to yell silently correctly.",
      "I always yell silently on Mondays.",
      "You should never yell silently in public.",
      "The instructions said to yell silently first thing in the morning."
    ]
  },
  {
    "id": "idiom_9635",
    "idiom": "yeoman's service",
    "definition": "Arduous work, performed in a vigorous, committed manner.",
    "wrongDefinitions": [
      "a literal yeoman's service",
      "to lose control",
      "showing poor judgment"
    ],
    "examples": [
      {
        "sentence": "He hath done yeoman's service, and proved himself staunch and faithful."
      },
      {
        "sentence": "I once did hold it, as our statists do,A baseness to write fair and labour'd muchHow to forget that learning, but, sir, nowIt did me yeoman's service."
      },
      {
        "sentence": "[O]n many occasions his liberality did him genuine yeoman's service."
      }
    ],
    "wrongExamples": [
      "This yeoman's service is made of plastic.",
      "That yeoman's service looks brand new.",
      "She collected several yeoman's services for her hobby.",
      "Where can I find a good yeoman's service?",
      "The price of yeoman's services has gone up."
    ],
    "context": "UK"
  },
  {
    "id": "idiom_9636",
    "idiom": "yes man",
    "definition": "A person who always agrees with their employer or superior.",
    "wrongDefinitions": [
      "a literal yes man",
      "a beneficial outcome",
      "to repeat an error"
    ],
    "examples": [
      {
        "sentence": "Crowds of yes men elbowed one another out of the way, hoping to get a chance to kiss the boss's ring."
      },
      {
        "sentence": "The function of a Vice-President is the job of a yes-man, as they call it in America."
      },
      {
        "sentence": "Rice is a \"yes man,\" says one former top government official. \"She thinks her job is just to figure out what the president is trying to say and then to say it more articulately."
      }
    ],
    "wrongExamples": [
      "The yes man was on sale yesterday.",
      "I've never seen a yes man like that before.",
      "My friend owns three yes mans.",
      "She collected several yes mans for her hobby.",
      "This yes man is made of plastic."
    ]
  },
  {
    "id": "idiom_9637",
    "idiom": "yes to death",
    "definition": "To agree with someone, often sarcastically.",
    "wrongDefinitions": [
      "exactly what \"yes to death\" sounds like",
      "a beneficial outcome",
      "to begin something reluctantly"
    ],
    "examples": [
      {
        "sentence": "I was yessed to death."
      },
      {
        "sentence": "There's a fruit-man on our street whose name is Mr. PeteAnd he keeps good things to eat but you should hear him speakWhen you ask him anything he never answers noHe just yesses you to death and then he takes your dough."
      }
    ],
    "wrongExamples": [
      "yes by death",
      "The manual shows how to yes to death properly.",
      "You should never yes to death in public.",
      "It takes practice to yes to death correctly.",
      "He tried to yes to death but failed miserably."
    ]
  },
  {
    "id": "idiom_9638",
    "idiom": "yield the ghost",
    "definition": "To give up the ghost.",
    "wrongDefinitions": [
      "exactly what \"yield the ghost\" sounds like",
      "an unnecessary action",
      "experiencing confusion"
    ],
    "examples": [
      {
        "sentence": "And often did I strive / To yield the ghost: but still the envious flood / Stopped in my soul, and would not let it forth."
      }
    ],
    "wrongExamples": [
      "yield ghost",
      "It takes practice to yield the ghost correctly.",
      "You should never yield the ghost in public.",
      "The instructions said to yield the ghost first thing in the morning.",
      "He tried to yield the ghost but failed miserably."
    ]
  },
  {
    "id": "idiom_9639",
    "idiom": "yield up the ghost",
    "definition": "For a person, to die.",
    "wrongDefinitions": [
      "a literal yield up the ghost",
      "to show weakness",
      "experiencing confusion"
    ],
    "examples": [
      {
        "sentence": "Then fell she down straightway at his feet, and yielded up the ghost: and the young men came in, and found her dead, and, carrying her forth, buried her by her husband."
      }
    ],
    "wrongExamples": [
      "My friend owns three yield up the ghosts.",
      "The yield up the ghost was on sale yesterday.",
      "She lost her yield up the ghost last week.",
      "The price of yield up the ghosts has gone up.",
      "He bought a yield up the ghost at the store."
    ]
  },
  {
    "id": "idiom_964",
    "idiom": "break someone's back",
    "definition": "Alternative form of break the back of (overburden).",
    "wrongDefinitions": [
      "to shatter someone's back",
      "to avoid responsibility",
      "to continue despite difficulty"
    ],
    "examples": [
      {
        "sentence": "Would it break your back to pay me a compliment once in a while?"
      },
      {
        "sentence": "My books are sitting at the top of the stack nowThe longer words are really breaking my back now."
      },
      {
        "sentence": "Fuck all those nights I moaned real loud / Fuck it, I faked it, aren't you proud? / Fuck all those nights you thought you broke my back / Well, guess what yo, your sex was wack."
      }
    ],
    "wrongExamples": [
      "broke someone's back",
      "He tried to break someone's back but failed miserably.",
      "I always break someone's back on Mondays.",
      "The instructions said to break someone's back first thing in the morning.",
      "Can you teach me to break someone's back?"
    ]
  },
  {
    "id": "idiom_9640",
    "idiom": "you all",
    "definition": "All of you; plural form of you, including everyone being addressed.",
    "wrongDefinitions": [
      "a literal you all",
      "a beneficial outcome",
      "to continue despite difficulty"
    ],
    "examples": [
      {
        "sentence": "I'm very happy to see you all."
      },
      {
        "sentence": "I ain't never been as far as you-all aim to go."
      }
    ],
    "wrongExamples": [
      "She lost her you all last week.",
      "My friend owns three you alls.",
      "This you all is made of plastic.",
      "Where can I find a good you all?",
      "I've never seen a you all like that before."
    ]
  },
  {
    "id": "idiom_9641",
    "idiom": "you bet",
    "definition": "Expresses support, agreement, certainty or emphasis.",
    "wrongDefinitions": [
      "a literal you bet",
      "to create confusion",
      "being overly cautious"
    ],
    "examples": [
      {
        "sentence": "You bet they'll re-run such a successful show next season."
      },
      {
        "sentence": "\"Hey, thanks for all your hard work yesterday.\" / \"You bet!\"."
      },
      {
        "sentence": "\"Could you give me a hand?\" / \"You bet!\"."
      }
    ],
    "wrongExamples": [
      "That you bet looks brand new.",
      "My friend owns three you bets.",
      "She lost her you bet last week.",
      "This you bet is made of plastic.",
      "She collected several you bets for her hobby."
    ]
  },
  {
    "id": "idiom_9642",
    "idiom": "you can say that again",
    "definition": "That is very true.",
    "wrongDefinitions": [
      "a literal you can say that again",
      "to cause problems",
      "to celebrate prematurely"
    ],
    "examples": [
      {
        "sentence": "Mandarin: 誰說不是呢 / 谁说不是呢 (shéi shuō bù shì ne), 可不是嗎 / 可不是吗 (kě bù shì ma)."
      }
    ],
    "wrongExamples": [
      "He bought a you can say that again at the store.",
      "The you can say that again was on sale yesterday.",
      "This you can say that again is made of plastic.",
      "The price of you can say that agains has gone up.",
      "She lost her you can say that again last week."
    ]
  },
  {
    "id": "idiom_9643",
    "idiom": "you can't be half pregnant",
    "definition": "Said of an either-or situation; there are only two available choices.",
    "wrongDefinitions": [
      "a literal you can't be half pregnant",
      "to gain advantage",
      "experiencing confusion"
    ],
    "examples": [
      {
        "sentence": "Alex, you can't be half pregnant. If you keep doing other work that falls outside of your logo design process, you'll send mixed messages to all of your stakeholders."
      }
    ],
    "wrongExamples": [
      "The you can't be half pregnant was on sale yesterday.",
      "I've never seen a you can't be half pregnant like that before.",
      "That you can't be half pregnant looks brand new.",
      "She lost her you can't be half pregnant last week.",
      "He bought a you can't be half pregnant at the store."
    ]
  },
  {
    "id": "idiom_9644",
    "idiom": "you can't judge a book by its cover",
    "definition": "It is not possible to make reliable judgments about things or people by considering external appearances alone.",
    "wrongDefinitions": [
      "a literal you can't judge a book by its cover",
      "something done carelessly",
      "having excessive pride"
    ],
    "examples": [
      {
        "sentence": "Mandarin: 人不可貌相 (zh) (bùyào yǐmàoqǔrén)."
      },
      {
        "sentence": "Ancient Greek: πώγων οὐ ποιεῖ φιλόσοφον (pṓgōn ou poieî philósophon)."
      },
      {
        "sentence": "Bokmål: man kan ikke dømme boken etter omslaget, man skal aldri skue hunden på hårene (no)."
      }
    ],
    "wrongExamples": [
      "The you can't judge a book by its cover was on sale yesterday.",
      "He bought a you can't judge a book by its cover at the store.",
      "She collected several you can't judge a book by its covers for her hobby.",
      "That you can't judge a book by its cover looks brand new.",
      "This you can't judge a book by its cover is made of plastic."
    ]
  },
  {
    "id": "idiom_9646",
    "idiom": "you can't say fairer than that",
    "definition": "That is fair, good, or reasonable; one cannot hope for a better decision or outcome.",
    "wrongDefinitions": [
      "a literal you can't say fairer than that",
      "something done carelessly",
      "to prepare for something"
    ],
    "examples": [],
    "wrongExamples": [
      "My friend owns three you can't say fairer than thats.",
      "This you can't say fairer than that is made of plastic.",
      "The price of you can't say fairer than thats has gone up.",
      "That you can't say fairer than that looks brand new.",
      "She lost her you can't say fairer than that last week."
    ],
    "context": "UK"
  },
  {
    "id": "idiom_9647",
    "idiom": "you can't step in the same river twice",
    "definition": "It is not possible to repeat past experiences, as time changes all things.",
    "wrongDefinitions": [
      "a literal you can't step in the same river twice",
      "to face challenges",
      "to attempt unsuccessfully"
    ],
    "examples": [],
    "wrongExamples": [
      "My friend owns three you can't step in the same river twices.",
      "The you can't step in the same river twice was on sale yesterday.",
      "He bought a you can't step in the same river twice at the store.",
      "That you can't step in the same river twice looks brand new.",
      "Where can I find a good you can't step in the same river twice?"
    ]
  },
  {
    "id": "idiom_9648",
    "idiom": "you gals",
    "definition": "You (plural).",
    "wrongDefinitions": [
      "a literal you gals",
      "a beneficial outcome",
      "to prepare for something"
    ],
    "examples": [
      {
        "sentence": "Hey you gals! How you doin'?"
      },
      {
        "sentence": "You gals headin' down to the beach?"
      }
    ],
    "wrongExamples": [
      "That you gals looks brand new.",
      "He bought a you gals at the store.",
      "This you gals is made of plastic.",
      "The price of you galss has gone up.",
      "The you gals was on sale yesterday."
    ]
  },
  {
    "id": "idiom_9649",
    "idiom": "you know it",
    "definition": "Indicates agreement, approval, encouragement.",
    "wrongDefinitions": [
      "a literal you know it",
      "an unnecessary action",
      "to celebrate prematurely"
    ],
    "examples": [
      {
        "sentence": "What he did to her was wrong.\" \"You know it, sister!"
      },
      {
        "sentence": "I've still got a few years on the chain gang.\" \"Counting the days, huh?\" \"You know it."
      },
      {
        "sentence": "He's a little bit older, mind you, but good people, if you know what I'm saying to you ...\" \"Italian, right?\" \"You know it, baby, and -\" \"Over fifty? Widowed? Grown children?\" \"You're a mind reader!"
      }
    ],
    "wrongExamples": [
      "She collected several you know its for her hobby.",
      "Where can I find a good you know it?",
      "My friend owns three you know its.",
      "This you know it is made of plastic.",
      "The you know it was on sale yesterday."
    ]
  },
  {
    "id": "idiom_965",
    "idiom": "break someone's face",
    "definition": "To beat up someone violently.",
    "wrongDefinitions": [
      "to shatter someone's face",
      "to cause problems",
      "to delay an action"
    ],
    "examples": [],
    "wrongExamples": [
      "broke someone's face",
      "The manual shows how to break someone's face properly.",
      "I always break someone's face on Mondays.",
      "You should never break someone's face in public.",
      "Can you teach me to break someone's face?"
    ]
  },
  {
    "id": "idiom_9650",
    "idiom": "you knows it",
    "definition": "Indicates agreement, approval, encouragement.",
    "wrongDefinitions": [
      "a literal you knows it",
      "something done carelessly",
      "having excessive pride"
    ],
    "examples": [
      {
        "sentence": "What he did to her was wrong."
      },
      {
        "sentence": "Mose would ha rallied, ef eed a been in our ward - ha ! ha ! ha ! - you knows it, Mass Richard !"
      },
      {
        "sentence": "Buster: (impressed) You'se a cool dude, Butch. / Butch: Hey, you knows it, baby."
      }
    ],
    "wrongExamples": [
      "That you knows it looks brand new.",
      "This you knows it is made of plastic.",
      "He bought a you knows it at the store.",
      "Where can I find a good you knows it?",
      "The you knows it was on sale yesterday."
    ]
  },
  {
    "id": "idiom_9651",
    "idiom": "you know what",
    "definition": "Used, often as a question, to get someone's attention before announcing something.",
    "wrongDefinitions": [
      "a literal you know what",
      "a beneficial outcome",
      "feeling overwhelmed"
    ],
    "examples": [
      {
        "sentence": "Well, I guess I've got to say, I love the Madonna one that we did - the Drowned world tour. Actually, you know what? The first Blonde Ambition tour I loved. The \"Vogue\" thing - that was a memorable moment in my lifetime."
      }
    ],
    "wrongExamples": [
      "He bought a you know what at the store.",
      "The you know what was on sale yesterday.",
      "She lost her you know what last week.",
      "Where can I find a good you know what?",
      "She collected several you know whats for her hobby."
    ]
  },
  {
    "id": "idiom_9652",
    "idiom": "you'll never guess",
    "definition": "I have something very surprising to say; you won't be able to guess what I'm about to say.",
    "wrongDefinitions": [
      "a literal you'll never guess",
      "to gain advantage",
      "feeling overwhelmed"
    ],
    "examples": [],
    "wrongExamples": [
      "The price of you'll never guesss has gone up.",
      "He bought a you'll never guess at the store.",
      "The you'll never guess was on sale yesterday.",
      "That you'll never guess looks brand new.",
      "I've never seen a you'll never guess like that before."
    ]
  },
  {
    "id": "idiom_9653",
    "idiom": "you lot",
    "definition": "You (plural).",
    "wrongDefinitions": [
      "a literal you lot",
      "to take charge",
      "to celebrate prematurely"
    ],
    "examples": [
      {
        "sentence": "You lot had better knock it off."
      },
      {
        "sentence": "I'm not s'posed ter talk abou' it, not even ter you lot."
      }
    ],
    "wrongExamples": [
      "The price of you lots has gone up.",
      "She collected several you lots for her hobby.",
      "He bought a you lot at the store.",
      "The you lot was on sale yesterday.",
      "She lost her you lot last week."
    ],
    "context": "UK"
  },
  {
    "id": "idiom_9654",
    "idiom": "you man",
    "definition": "You (plural).",
    "wrongDefinitions": [
      "a literal you man",
      "to achieve success",
      "lacking preparation"
    ],
    "examples": [
      {
        "sentence": "You man are peak (being unfair)."
      }
    ],
    "wrongExamples": [
      "The you man was on sale yesterday.",
      "She collected several you mans for her hobby.",
      "He bought a you man at the store.",
      "I've never seen a you man like that before.",
      "That you man looks brand new."
    ]
  },
  {
    "id": "idiom_9655",
    "idiom": "you name it",
    "definition": "All kinds of things; expresses that further examples are unnecessary, often after a short list of items.",
    "wrongDefinitions": [
      "a literal you name it",
      "a harmful practice",
      "experiencing confusion"
    ],
    "examples": [
      {
        "sentence": "There were ducks, geese, swans, you name it on the lake."
      },
      {
        "sentence": "- What can you buy over the Internet?- You name it."
      },
      {
        "sentence": "By Monday afternoon we were finished - loadwise, physically, mentally, you name it, we'd had a gutful of it."
      }
    ],
    "wrongExamples": [
      "She collected several you name its for her hobby.",
      "That you name it looks brand new.",
      "He bought a you name it at the store.",
      "My friend owns three you name its.",
      "The price of you name its has gone up."
    ]
  },
  {
    "id": "idiom_9656",
    "idiom": "young at heart",
    "definition": "Having the joy and vitality associated with younger people, despite one's own advanced age.",
    "wrongDefinitions": [
      "a literal young at heart",
      "an unnecessary action",
      "to celebrate prematurely"
    ],
    "examples": [
      {
        "sentence": "Mandarin: 童心未泯 (zh) (tóngxīnwèimǐn)."
      }
    ],
    "wrongExamples": [
      "My friend owns three young at hearts.",
      "Where can I find a good young at heart?",
      "The price of young at hearts has gone up.",
      "He bought a young at heart at the store.",
      "The young at heart was on sale yesterday."
    ]
  },
  {
    "id": "idiom_9657",
    "idiom": "young blood",
    "definition": "Young or youthful people, especially as a source of revitalizing force (in a team, organization, etc.).",
    "wrongDefinitions": [
      "a literal young blood",
      "to lose control",
      "to hurry through something"
    ],
    "examples": [
      {
        "sentence": "Young blood must have its course, lad, and every dog its day."
      },
      {
        "sentence": "Every Saturday evening, raw young bloods of the village would meet for a drink, and the wine made us lively. We stuck a sprig of basil behind our ears, one of my cousins took his guitar, and we went serenading."
      }
    ],
    "wrongExamples": [
      "The young blood was on sale yesterday.",
      "He bought a young blood at the store.",
      "Where can I find a good young blood?",
      "This young blood is made of plastic.",
      "I've never seen a young blood like that before."
    ]
  },
  {
    "id": "idiom_9658",
    "idiom": "young fogey",
    "definition": "A young and overly conservative person.",
    "wrongDefinitions": [
      "a literal young fogey",
      "a common mistake",
      "to ignore a warning"
    ],
    "examples": [],
    "wrongExamples": [
      "I've never seen a young fogey like that before.",
      "That young fogey looks brand new.",
      "My friend owns three young fogeys.",
      "He bought a young fogey at the store.",
      "This young fogey is made of plastic."
    ],
    "context": "UK"
  },
  {
    "id": "idiom_9659",
    "idiom": "young Turk",
    "definition": "From the late-19th to the early-20th century, a member of a movement that campaigned for reform of the Ottoman Empire.",
    "wrongDefinitions": [
      "a literal young turk",
      "to cause problems",
      "being too confident"
    ],
    "examples": [
      {
        "sentence": "What! Roscoe?\" inquired the principal.\"Yes.\"\"Is he in any mischief?\"\"Mischief? I should say so! Why, he's a regular young Turk.\"\"A young Turk? I don't think I understand you, James.\"\"I mean, he's a young ruffian."
      },
      {
        "sentence": "He arrives at a time when jazz's discontented Young Turks have disdainfully turned away from their audiences and gone off to explore the way-out."
      }
    ],
    "wrongExamples": [
      "My friend owns three young turks.",
      "He bought a young turk at the store.",
      "The young turk was on sale yesterday.",
      "Where can I find a good young turk?",
      "This young turk is made of plastic."
    ]
  },
  {
    "id": "idiom_966",
    "idiom": "break someone's heart",
    "definition": "To cause a person to feel grief, disappointment, or sadness.",
    "wrongDefinitions": [
      "to shatter someone's heart",
      "to avoid responsibility",
      "to celebrate prematurely"
    ],
    "examples": [
      {
        "sentence": "Don't go breaking my heart / I couldn't if I tried / Honey if I get restless / Baby you're not that kind."
      },
      {
        "sentence": "If you break her heart, I'll break your legs."
      },
      {
        "sentence": "We're just friends,\" what are you sayin'? / Said \"there's another,\" and looked right in my eyes / My first love broke my heart for the first time."
      }
    ],
    "wrongExamples": [
      "broke someone's heart",
      "You should never break someone's heart in public.",
      "She learned to break someone's heart at school.",
      "Everyone should break someone's heart at least once.",
      "They forgot to break someone's heart before leaving."
    ]
  },
  {
    "id": "idiom_9661",
    "idiom": "your boy",
    "definition": "I, me, or myself; yours truly.",
    "wrongDefinitions": [
      "a literal your boy",
      "to face challenges",
      "remaining uncertain"
    ],
    "examples": [],
    "wrongExamples": [
      "She lost her your boy last week.",
      "The price of your boys has gone up.",
      "Where can I find a good your boy?",
      "My friend owns three your boys.",
      "I've never seen a your boy like that before."
    ]
  },
  {
    "id": "idiom_9662",
    "idiom": "you're telling me",
    "definition": "Used to indicate that the speaker was in agreement with the preceding statement before it was made.",
    "wrongDefinitions": [
      "a literal you're telling me",
      "to take charge",
      "appearing foolish"
    ],
    "examples": [],
    "wrongExamples": [
      "I've never seen a you're telling me like that before.",
      "The price of you're telling mes has gone up.",
      "That you're telling me looks brand new.",
      "This you're telling me is made of plastic.",
      "She collected several you're telling mes for her hobby."
    ]
  },
  {
    "id": "idiom_9663",
    "idiom": "your girl",
    "definition": "I, me, or myself; yours truly.",
    "wrongDefinitions": [
      "a literal your girl",
      "to face challenges",
      "having excessive pride"
    ],
    "examples": [
      {
        "sentence": "The minute you pull that one, your girl is out."
      }
    ],
    "wrongExamples": [
      "The price of your girls has gone up.",
      "She collected several your girls for her hobby.",
      "He bought a your girl at the store.",
      "She lost her your girl last week.",
      "The your girl was on sale yesterday."
    ]
  },
  {
    "id": "idiom_9664",
    "idiom": "your guess is as good as mine",
    "definition": "I don't know; I have no idea.",
    "wrongDefinitions": [
      "a literal your guess is as good as mine",
      "a common mistake",
      "lacking preparation"
    ],
    "examples": [],
    "wrongExamples": [
      "I've never seen a your guess is as good as mine like that before.",
      "She lost her your guess is as good as mine last week.",
      "This your guess is as good as mine is made of plastic.",
      "That your guess is as good as mine looks brand new.",
      "My friend owns three your guess is as good as mines."
    ]
  },
  {
    "id": "idiom_9665",
    "idiom": "your mileage may vary",
    "definition": "It may work differently in your situation, or be different in your experience.",
    "wrongDefinitions": [
      "a literal your mileage may vary",
      "to face challenges",
      "to finish something completely"
    ],
    "examples": [
      {
        "sentence": "The battery lasts a day in my phone, but your mileage may vary."
      },
      {
        "sentence": "When that definition is executed, the metadata for the temporary table is put into your schema (most likely-your mileage may vary), but no space is allocated to hold data."
      },
      {
        "sentence": "In other words, your mileage may vary and my disk-size figures are just estimates provided for your convenience."
      }
    ],
    "wrongExamples": [
      "The your mileage may vary was on sale yesterday.",
      "That your mileage may vary looks brand new.",
      "This your mileage may vary is made of plastic.",
      "My friend owns three your mileage may varys.",
      "The price of your mileage may varys has gone up."
    ]
  },
  {
    "id": "idiom_9666",
    "idiom": "yours sincerely",
    "definition": "A polite, formulaic phrase used at the end of a letter, especially when the sender knows the recipient's name.",
    "wrongDefinitions": [
      "a literal yours sincerely",
      "to gain advantage",
      "experiencing confusion"
    ],
    "examples": [
      {
        "sentence": "Mandarin: 肅然 / 肃然 (zh) (sùrán), 謹上 / 谨上 (zh) (jǐnshàng), 鄙人 (zh) (bǐrén), 真摯地 / 真挚地 (zhēnzhì-de)."
      }
    ],
    "wrongExamples": [
      "This yours sincerely is made of plastic.",
      "That yours sincerely looks brand new.",
      "The price of yours sincerelys has gone up.",
      "She collected several yours sincerelys for her hobby.",
      "My friend owns three yours sincerelys."
    ]
  },
  {
    "id": "idiom_9667",
    "idiom": "yours trulies",
    "definition": "We, us, or ourselves.",
    "wrongDefinitions": [
      "a literal yours trulies",
      "something done carelessly",
      "to prepare for something"
    ],
    "examples": [],
    "wrongExamples": [
      "She collected several yours truliess for her hobby.",
      "My friend owns three yours truliess.",
      "The yours trulies was on sale yesterday.",
      "The price of yours truliess has gone up.",
      "He bought a yours trulies at the store."
    ]
  },
  {
    "id": "idiom_9668",
    "idiom": "yours truly",
    "definition": "Used to close a note or letter.",
    "wrongDefinitions": [
      "a literal yours truly",
      "to lose control",
      "to delay an action"
    ],
    "examples": [
      {
        "sentence": "Please write back soon! Yours truly, Alice."
      },
      {
        "sentence": "This one was created by yours truly."
      },
      {
        "sentence": "Nobody in Africa, but yours truly, can get a good head of steam on the old African Queen."
      }
    ],
    "wrongExamples": [
      "He bought a yours truly at the store.",
      "The yours truly was on sale yesterday.",
      "I've never seen a yours truly like that before.",
      "That yours truly looks brand new.",
      "She lost her yours truly last week."
    ]
  },
  {
    "id": "idiom_9669",
    "idiom": "you shouldn't have",
    "definition": "Used to express gratitude at unnecessary generosity, especially when receiving a gift.",
    "wrongDefinitions": [
      "a literal you shouldn't have",
      "a common mistake",
      "to prepare for something"
    ],
    "examples": [
      {
        "sentence": "What a lovely vase! You shouldn't have!"
      }
    ],
    "wrongExamples": [
      "That you shouldn't have looks brand new.",
      "She collected several you shouldn't haves for her hobby.",
      "The you shouldn't have was on sale yesterday.",
      "The price of you shouldn't haves has gone up.",
      "Where can I find a good you shouldn't have?"
    ]
  },
  {
    "id": "idiom_967",
    "idiom": "break the back of",
    "definition": "To complete the greater part of (a project) or solve the most critical part of (a problem).",
    "wrongDefinitions": [
      "to shatter the back of",
      "a beneficial outcome",
      "lacking preparation"
    ],
    "examples": [
      {
        "sentence": "I've broken the back of painting the shed - I'll finish it after lunch.",
        "usedIdiom": "broken the back of"
      },
      {
        "sentence": "[...] broke the back of the housing problem in this country .",
        "usedIdiom": "broke the back of"
      },
      {
        "sentence": "I think we will find, or I predict that we will find, that during the course of this year we will break the back of the energy crisis."
      }
    ],
    "wrongExamples": [
      "break back of",
      "broke the back of",
      "break the back by",
      "break the back",
      "I always break the back of on Mondays."
    ]
  },
  {
    "id": "idiom_9670",
    "idiom": "you think",
    "definition": "A sarcastic, rhetorical response to an obvious statement.",
    "wrongDefinitions": [
      "a literal you think",
      "to make things better",
      "having excessive pride"
    ],
    "examples": [
      {
        "sentence": "I reckon the trees are greener in spring than in winter."
      }
    ],
    "wrongExamples": [
      "She lost her you think last week.",
      "The you think was on sale yesterday.",
      "He bought a you think at the store.",
      "She collected several you thinks for her hobby.",
      "I've never seen a you think like that before."
    ]
  },
  {
    "id": "idiom_9671",
    "idiom": "you what",
    "definition": "An intensified version of what or huh.",
    "wrongDefinitions": [
      "a literal you what",
      "an unnecessary action",
      "feeling overwhelmed"
    ],
    "examples": [],
    "wrongExamples": [
      "The price of you whats has gone up.",
      "He bought a you what at the store.",
      "She lost her you what last week.",
      "I've never seen a you what like that before.",
      "The you what was on sale yesterday."
    ],
    "context": "UK"
  },
  {
    "id": "idiom_9672",
    "idiom": "you wish",
    "definition": "Used to express the speaker's skepticism about a preceding statement concerning some desired or assumed state of affairs.",
    "wrongDefinitions": [
      "a literal you wish",
      "to cause problems",
      "having excessive pride"
    ],
    "examples": [
      {
        "sentence": "When I grow up, I'm going to be a superhero!\" / \"Huh, you wish!"
      },
      {
        "sentence": "They can't bench me. I'm the best shooter on the team.\" / \"You wish!"
      }
    ],
    "wrongExamples": [
      "This you wish is made of plastic.",
      "Where can I find a good you wish?",
      "That you wish looks brand new.",
      "He bought a you wish at the store.",
      "My friend owns three you wishs."
    ]
  },
  {
    "id": "idiom_9673",
    "idiom": "zero-day",
    "definition": "Of warez, released less than a day after the official product release.",
    "wrongDefinitions": [
      "a literal zero-day",
      "to create confusion",
      "showing poor judgment"
    ],
    "examples": [
      {
        "sentence": "Back then, having \"zero day warez\" (brand new cracked games that are not even one day old yet) on your BBS first was a big status symbol."
      },
      {
        "sentence": "If your software is popular and has a high demand, you will want to defend against the \"zero-day\" cracker."
      },
      {
        "sentence": "Before discussing ways to counter zero-day attacks, let's begin with the definition of what a zero-day attack is. A zero-day attack is one that the vendor does not yet know about or hasn't been fixed."
      }
    ],
    "wrongExamples": [
      "She lost her zero-day last week.",
      "He bought a zero-day at the store.",
      "The zero-day was on sale yesterday.",
      "This zero-day is made of plastic.",
      "The price of zero-days has gone up."
    ]
  },
  {
    "id": "idiom_9674",
    "idiom": "zero in",
    "definition": "To focus one's aim; to zoom in and center (on something).",
    "wrongDefinitions": [
      "exactly what \"zero in\" sounds like",
      "to achieve success",
      "to continue despite difficulty"
    ],
    "examples": [
      {
        "sentence": "The pilot zeroed in on the bunker and launched a guided missile."
      },
      {
        "sentence": "Zero in and find a watermark in the image."
      },
      {
        "sentence": "When you invoke the VAX C compiler with -p for profiling it generates an assembly-language call to a profiling subroutine for which I substituted my own heap-checker, and that enabled me to zero in on a heap-violation which was caused by an array-out-of-bounds condition."
      }
    ],
    "wrongExamples": [
      "zero of",
      "I always zero in on Mondays.",
      "Can you teach me to zero in?",
      "He tried to zero in but failed miserably.",
      "The instructions said to zero in first thing in the morning."
    ]
  },
  {
    "id": "idiom_9675",
    "idiom": "zig when one should zag",
    "definition": "To misstep or err.",
    "wrongDefinitions": [
      "exactly what \"zig when one should zag\" sounds like",
      "to face challenges",
      "having excessive pride"
    ],
    "examples": [
      {
        "sentence": "As I came around the last corner of the house, I zigged when I should have zagged, or zagged when I should have zigged. Either way, Brett went off the track and into a clump of birch trees. I turned around and saw the sled was gone [...]."
      }
    ],
    "wrongExamples": [
      "zig when one should",
      "It takes practice to zig when one should zag correctly.",
      "The manual shows how to zig when one should zag properly.",
      "She learned to zig when one should zag at school.",
      "You should never zig when one should zag in public."
    ]
  },
  {
    "id": "idiom_9676",
    "idiom": "zip one's lip",
    "definition": "To refrain from or to stop talking; to be quiet; shut up.",
    "wrongDefinitions": [
      "exactly what \"zip one's lip\" sounds like",
      "to make things better",
      "to hurry through something"
    ],
    "examples": [
      {
        "sentence": "Why don't you just zip your lip? I'm tired of listening to you.",
        "usedIdiom": "zip your lip"
      }
    ],
    "wrongExamples": [
      "They forgot to zip one's lip before leaving.",
      "The manual shows how to zip one's lip properly.",
      "She learned to zip one's lip at school.",
      "It takes practice to zip one's lip correctly.",
      "Can you teach me to zip one's lip?"
    ]
  },
  {
    "id": "idiom_9677",
    "idiom": "zip up",
    "definition": "To close with a zip fastener.",
    "wrongDefinitions": [
      "exactly what \"zip up\" sounds like",
      "a common mistake",
      "to ignore a warning"
    ],
    "examples": [
      {
        "sentence": "Always check if you've zipped up your fly before you go out."
      },
      {
        "sentence": "I'll zip up my lip."
      }
    ],
    "wrongExamples": [
      "They forgot to zip up before leaving.",
      "I always zip up on Mondays.",
      "He tried to zip up but failed miserably.",
      "You should never zip up in public.",
      "It takes practice to zip up correctly."
    ]
  },
  {
    "id": "idiom_9678",
    "idiom": "zombie out",
    "definition": "To become listless, vacant, or unresponsive.",
    "wrongDefinitions": [
      "exactly what \"zombie out\" sounds like",
      "to show weakness",
      "to celebrate prematurely"
    ],
    "examples": [
      {
        "sentence": "After Dennis got killed, my mom just kind of zombied out for a couple of years."
      },
      {
        "sentence": "After I've been zombied out, will they hurt my dad?"
      },
      {
        "sentence": "After the 'copter had crashed on Cobre Road, [Cody] figured he'd zombied out."
      }
    ],
    "wrongExamples": [
      "He tried to zombie out but failed miserably.",
      "You should never zombie out in public.",
      "I always zombie out on Mondays.",
      "It takes practice to zombie out correctly.",
      "She learned to zombie out at school."
    ]
  },
  {
    "id": "idiom_968",
    "idiom": "break the bank",
    "definition": "At a casino etc., to win all the money that is available to be paid.",
    "wrongDefinitions": [
      "to shatter the bank",
      "to achieve success",
      "to delay an action"
    ],
    "examples": [
      {
        "sentence": "Or, similarly, consider the man determined to break the bank at Monte Carlo by studying the frequencies with which a certain roulette wheel lands in the red."
      },
      {
        "sentence": "Home Security Doesn't Have to Break the Bank."
      }
    ],
    "wrongExamples": [
      "break bank",
      "broke the bank",
      "Everyone should break the bank at least once.",
      "Can you teach me to break the bank?",
      "The manual shows how to break the bank properly."
    ]
  },
  {
    "id": "idiom_969",
    "idiom": "break the buck",
    "definition": "To fall below the value of one dollar per share.",
    "wrongDefinitions": [
      "to shatter the buck",
      "to show weakness",
      "to begin something reluctantly"
    ],
    "examples": [
      {
        "sentence": "In 1994, during the Orange County bankruptcy, a few funds were poised to break the buck, until their parent companies stepped in."
      },
      {
        "sentence": "We were likely going to see more funds halt redemptions\" and break the buck. The insurance program is part of a wider rescue package [...]."
      }
    ],
    "wrongExamples": [
      "break buck",
      "broke the buck",
      "He tried to break the buck but failed miserably.",
      "It takes practice to break the buck correctly.",
      "The instructions said to break the buck first thing in the morning."
    ]
  },
  {
    "id": "idiom_970",
    "idiom": "break the cycle",
    "definition": "To act so as to end a repeating pattern of harmful or otherwise negative behavior.",
    "wrongDefinitions": [
      "to shatter the cycle",
      "to achieve success",
      "to delay an action"
    ],
    "examples": [],
    "wrongExamples": [
      "break cycle",
      "broke the cycle",
      "You should never break the cycle in public.",
      "Can you teach me to break the cycle?",
      "She learned to break the cycle at school."
    ]
  },
  {
    "id": "idiom_971",
    "idiom": "break the deadlock",
    "definition": "To score the first goal or point in a competition.",
    "wrongDefinitions": [
      "to shatter the deadlock",
      "to cause problems",
      "remaining uncertain"
    ],
    "examples": [
      {
        "sentence": "The Gunners continued to press after the break but it was Leeds who broke the deadlock in the 54th minute. There was no doubt about the penalty either, with Denilson clumsily fouling Gradel and Snodgrass stepping up to find the bottom corner of the net.",
        "usedIdiom": "broke the deadlock"
      },
      {
        "sentence": "Sterling was once again England's key figure, as he was in the Euros, scoring the goal that broke the deadlock before setting up the second for Kane.",
        "usedIdiom": "broke the deadlock"
      },
      {
        "sentence": "However, Colombia broke the deadlock, Leicy Santos toying with Rachel Daly after collecting Caicedo's pass, before sweeping a dipping effort over a caught-out Mary Earps. It was a luscious finish and the crowd enjoyed it.",
        "usedIdiom": "broke the deadlock"
      }
    ],
    "wrongExamples": [
      "break deadlock",
      "broke the deadlock",
      "You should never break the deadlock in public.",
      "The instructions said to break the deadlock first thing in the morning.",
      "He tried to break the deadlock but failed miserably."
    ]
  },
  {
    "id": "idiom_972",
    "idiom": "break the fourth wall",
    "definition": "To apparently communicate with reality directly, such as when characters of literature comment on the existence of a reader.",
    "wrongDefinitions": [
      "to shatter the fourth wall",
      "to avoid responsibility",
      "to hurry through something"
    ],
    "examples": [],
    "wrongExamples": [
      "break fourth wall",
      "broke the fourth wall",
      "break the fourth",
      "She learned to break the fourth wall at school.",
      "You should never break the fourth wall in public."
    ]
  },
  {
    "id": "idiom_973",
    "idiom": "break the ice",
    "definition": "To start to get to know people to avoid social awkwardness and formality.",
    "wrongDefinitions": [
      "to shatter the ice",
      "to avoid responsibility",
      "showing poor judgment"
    ],
    "examples": [
      {
        "sentence": "Including a few fun details in large group introductions can be a great way to break the ice."
      },
      {
        "sentence": "If it be so ſir, that you are the man Muſt ſteed us all, and me amongſt the reſt: And if you breake the ice and do this ſeeke, Atchieve the elder: ſet the yonger free, For our acceſſe, whose hap ſhall be to have her, will not so graceleſſe be, to be ingrate."
      }
    ],
    "wrongExamples": [
      "break ice",
      "broke the ice",
      "Everyone should break the ice at least once.",
      "She learned to break the ice at school.",
      "He tried to break the ice but failed miserably."
    ]
  },
  {
    "id": "idiom_974",
    "idiom": "break the Internet",
    "definition": "To cause a connection to the Internet, or the Internet itself, to malfunction.",
    "wrongDefinitions": [
      "to shatter the internet",
      "a harmful practice",
      "to finish something completely"
    ],
    "examples": [
      {
        "sentence": "Advocacy groups warned that entertainment companies-who invested heavily in lobbying for the bills-where trying to \"break the Internet\"; [...]."
      },
      {
        "sentence": "\"Obviously, Kim isn't the first person to claim to 'break the Internet.' In September Taylor Swift \"broke the Internet\" when she wore a T-shirt saying 'no it's Becky,' a super-meta reference to a Tumblr post where a user insisted that a picture of young Taylor was, in fact, someone named Becky. Beyoncé's surprise album 'broke the Internet' when she secretly released it last year. Alex from Target 'broke the Internet' just by looking cute at work. Even Obama's sensationally tan suit was almost able (but not quite) to 'break the Internet,' according to Shape magazine.\"."
      },
      {
        "sentence": "After the singer and actor wore it on the 2000 Grammy awards red carpet, the tech team at Google noticed it was the most popular search query ever. [...] At a 2019 Versace show, J-Lo broke the internet again when she wore a take on the original dress.",
        "usedIdiom": "broke the internet"
      }
    ],
    "wrongExamples": [
      "break Internet",
      "broke the Internet",
      "The instructions said to break the internet first thing in the morning.",
      "The manual shows how to break the internet properly.",
      "Everyone should break the internet at least once."
    ]
  },
  {
    "id": "idiom_975",
    "idiom": "break the Sabbath",
    "definition": "To violate (the holiness or sanctity of) the Sabbath (by not keeping it holy).",
    "wrongDefinitions": [
      "to shatter the sabbath",
      "a common mistake",
      "experiencing confusion"
    ],
    "examples": [
      {
        "sentence": "Matthew 12:5 Or have you not read in the Law, that on the Sabbath the priests in the temple break the Sabbath and are innocent? (New American Standard Bible, ©1995)."
      }
    ],
    "wrongExamples": [
      "break Sabbath",
      "broke the Sabbath",
      "He tried to break the sabbath but failed miserably.",
      "The instructions said to break the sabbath first thing in the morning.",
      "Can you teach me to break the sabbath?"
    ]
  },
  {
    "id": "idiom_976",
    "idiom": "break the seal",
    "definition": "To urinate, particularly for the first time after drinking alcohol.",
    "wrongDefinitions": [
      "to shatter the seal",
      "a harmful practice",
      "having excessive pride"
    ],
    "examples": [],
    "wrongExamples": [
      "break seal",
      "broke the seal",
      "You should never break the seal in public.",
      "They forgot to break the seal before leaving.",
      "Everyone should break the seal at least once."
    ]
  },
  {
    "id": "idiom_977",
    "idiom": "break the story",
    "definition": "To be the first to address or publicize an issue, often a news story.",
    "wrongDefinitions": [
      "to shatter the story",
      "to lose control",
      "to repeat an error"
    ],
    "examples": [],
    "wrongExamples": [
      "break story",
      "broke the story",
      "You should never break the story in public.",
      "The instructions said to break the story first thing in the morning.",
      "He tried to break the story but failed miserably."
    ]
  },
  {
    "id": "idiom_978",
    "idiom": "break the wheel",
    "definition": "To end a pattern of oppression, inequality, injustice, or abuse.",
    "wrongDefinitions": [
      "to shatter the wheel",
      "to create confusion",
      "appearing foolish"
    ],
    "examples": [
      {
        "sentence": "Finally, the fact that both protagonists are teenagers is worth considering not only as a mere feature of the dystopian fiction subgenre, but as a representation of the power of the younger generations in breaking the wheel and transforming society not only when they grow up and become adults, but from today.",
        "usedIdiom": "breaking the wheel"
      },
      {
        "sentence": "I do not see any possibility for breaking the wheel of the prevailing capitalist and liberal ideology or any kind of ideology.",
        "usedIdiom": "breaking the wheel"
      }
    ],
    "wrongExamples": [
      "break wheel",
      "broke the wheel",
      "You should never break the wheel in public.",
      "I always break the wheel on Mondays.",
      "The manual shows how to break the wheel properly."
    ]
  },
  {
    "id": "idiom_979",
    "idiom": "break up",
    "definition": "To break or separate into pieces.",
    "wrongDefinitions": [
      "to shatter up",
      "to take charge",
      "having excessive pride"
    ],
    "examples": [
      {
        "sentence": "Break up the cheese and put it in the salad."
      },
      {
        "sentence": "It broke up when it hit the ground.",
        "usedIdiom": "broke up"
      },
      {
        "sentence": "So, subject to the salvaging of serviceable parts, all five were withdrawn for breaking up in 1936-7, and thus ended one of the shortest histories of an important locomotive class on record.",
        "usedIdiom": "breaking up"
      }
    ],
    "wrongExamples": [
      "broke up",
      "They forgot to break up before leaving.",
      "I always break up on Mondays.",
      "She learned to break up at school.",
      "He tried to break up but failed miserably."
    ]
  },
  {
    "id": "idiom_980",
    "idiom": "break wind",
    "definition": "To expel gases generated during digestion, especially through the anus; to fart.",
    "wrongDefinitions": [
      "to shatter wind",
      "to create confusion",
      "showing poor judgment"
    ],
    "examples": [
      {
        "sentence": "I broke wind and excused myself afterwards.",
        "usedIdiom": "broke wind"
      }
    ],
    "wrongExamples": [
      "broke wind",
      "She learned to break wind at school.",
      "Can you teach me to break wind?",
      "He tried to break wind but failed miserably.",
      "I always break wind on Mondays."
    ]
  },
  {
    "id": "idiom_981",
    "idiom": "breathe a sigh of relief",
    "definition": "To be relieved; to feel relief.",
    "wrongDefinitions": [
      "exactly what \"breathe a sigh of relief\" sounds like",
      "to take charge",
      "lacking preparation"
    ],
    "examples": [
      {
        "sentence": "And the home fans breathed a huge sigh of relief barely two minutes later when Andros Townsend's cross was finished by Defoe."
      }
    ],
    "wrongExamples": [
      "breathe sigh of relief",
      "breathe a sigh on relief",
      "breathe a sigh of",
      "He tried to breathe a sigh of relief but failed miserably.",
      "The manual shows how to breathe a sigh of relief properly."
    ]
  },
  {
    "id": "idiom_982",
    "idiom": "breathe a word",
    "definition": "To divulge even part of a secret (usually used with a negative).",
    "wrongDefinitions": [
      "exactly what \"breathe a word\" sounds like",
      "to create confusion",
      "to delay an action"
    ],
    "examples": [
      {
        "sentence": "I warn you not to breathe a word of this to anyone, or else!"
      }
    ],
    "wrongExamples": [
      "breathe word",
      "She learned to breathe a word at school.",
      "They forgot to breathe a word before leaving.",
      "It takes practice to breathe a word correctly.",
      "The manual shows how to breathe a word properly."
    ]
  },
  {
    "id": "idiom_983",
    "idiom": "breathe down someone's neck",
    "definition": "To follow or supervise someone too closely, causing discomfort for that person.",
    "wrongDefinitions": [
      "exactly what \"breathe down someone's neck\" sounds like",
      "to make things better",
      "showing poor judgment"
    ],
    "examples": [
      {
        "sentence": "My boss never lets me get on with my work. He's always breathing down my neck and checking up on me."
      }
    ],
    "wrongExamples": [
      "breathe down someone's",
      "It takes practice to breathe down someone's neck correctly.",
      "Can you teach me to breathe down someone's neck?",
      "They forgot to breathe down someone's neck before leaving.",
      "I always breathe down someone's neck on Mondays."
    ]
  },
  {
    "id": "idiom_984",
    "idiom": "breathe easy",
    "definition": "To relax or feel secure about something.",
    "wrongDefinitions": [
      "exactly what \"breathe easy\" sounds like",
      "a common mistake",
      "to delay an action"
    ],
    "examples": [
      {
        "sentence": "You can breathe easy knowing that your savings account is insured against loss."
      }
    ],
    "wrongExamples": [
      "I always breathe easy on Mondays.",
      "She learned to breathe easy at school.",
      "Everyone should breathe easy at least once.",
      "The instructions said to breathe easy first thing in the morning.",
      "They forgot to breathe easy before leaving."
    ]
  },
  {
    "id": "idiom_985",
    "idiom": "breathe one's last",
    "definition": "To be defeated.",
    "wrongDefinitions": [
      "exactly what \"breathe one's last\" sounds like",
      "to face challenges",
      "to attempt unsuccessfully"
    ],
    "examples": [
      {
        "sentence": "Ah, Warwick! Montague hath breathed his last; And to the latest gasp cried out for Warwick,."
      },
      {
        "sentence": "She breathed her last surrounded by her family and friends, commending them to God and the study of his word."
      },
      {
        "sentence": "The Green Council\" is a tense chess game of an episode, kicking off the power vacuum that we knew was coming the moment Viserys breathed his last."
      }
    ],
    "wrongExamples": [
      "I always breathe one's last on Mondays.",
      "She learned to breathe one's last at school.",
      "You should never breathe one's last in public.",
      "Can you teach me to breathe one's last?",
      "The manual shows how to breathe one's last properly."
    ]
  },
  {
    "id": "idiom_986",
    "idiom": "breath of fresh air",
    "definition": "Something relieving, refreshing, or new.",
    "wrongDefinitions": [
      "a literal breath of fresh air",
      "to avoid responsibility",
      "remaining uncertain"
    ],
    "examples": [
      {
        "sentence": "After all those old policies and procedures, the new management approach is a breath of fresh air around here."
      },
      {
        "sentence": "Harper's speech was a breath of fresh air and offers a new beginning."
      }
    ],
    "wrongExamples": [
      "The breath of fresh air was on sale yesterday.",
      "This breath of fresh air is made of plastic.",
      "That breath of fresh air looks brand new.",
      "The price of breath of fresh airs has gone up.",
      "My friend owns three breath of fresh airs."
    ]
  },
  {
    "id": "idiom_987",
    "idiom": "bred-in-the-bone",
    "definition": "Firmly established or instilled; deep-seated.",
    "wrongDefinitions": [
      "a literal bred-in-the-bone",
      "a harmful practice",
      "to celebrate prematurely"
    ],
    "examples": [
      {
        "sentence": "They had the kind of bred-in-the-bone manners that were unobtrusively the same for one and all."
      },
      {
        "sentence": "But few could match the bred-in-the-bone exceptionalism rooted deep in America's self-image."
      },
      {
        "sentence": "Her navy had barely broken off its pursuit of the fleeing Spaniards, in fact, when Elizabeth exposed her bred-in-the-bone selfishness, her cold indifference to the well-being of the subjects whose supposed love for her she and the royal propagandists endlessly celebrated as one of the wonders of the age."
      }
    ],
    "wrongExamples": [
      "I've never seen a bred-in-the-bone like that before.",
      "The price of bred-in-the-bones has gone up.",
      "She lost her bred-in-the-bone last week.",
      "That bred-in-the-bone looks brand new.",
      "My friend owns three bred-in-the-bones."
    ]
  },
  {
    "id": "idiom_988",
    "idiom": "breed in the bone",
    "definition": "To establish or ingrain firmly within someone's nature.",
    "wrongDefinitions": [
      "exactly what \"breed in the bone\" sounds like",
      "a beneficial outcome",
      "to repeat an error"
    ],
    "examples": [
      {
        "sentence": "And for thy ill tongue, and worse practices, his lordship knows they are bred in the bone of thee."
      },
      {
        "sentence": "My father was a born aristocrat. I think, in some preexistent state, he must have been in the higher circles of spirits, and brought all his old court pride along with him; for it was ingrain, bred in the bone, though he was originally of poor and not in any way of noble family."
      },
      {
        "sentence": "Davies meticulously establishes the background, the breeding in the bone, of his hero's life."
      }
    ],
    "wrongExamples": [
      "breed in bone",
      "breed at the bone",
      "breed in the",
      "You should never breed in the bone in public.",
      "The instructions said to breed in the bone first thing in the morning."
    ]
  },
  {
    "id": "idiom_989",
    "idiom": "brick in",
    "definition": "To enclose with bricks.",
    "wrongDefinitions": [
      "exactly what \"brick in\" sounds like",
      "something done carelessly",
      "to delay an action"
    ],
    "examples": [],
    "wrongExamples": [
      "brick by",
      "He tried to brick in but failed miserably.",
      "I always brick in on Mondays.",
      "Can you teach me to brick in?",
      "They forgot to brick in before leaving."
    ]
  },
  {
    "id": "idiom_990",
    "idiom": "brick in one's hat",
    "definition": "Drunkenness.",
    "wrongDefinitions": [
      "a literal brick in one's hat",
      "to gain advantage",
      "being overly cautious"
    ],
    "examples": [
      {
        "sentence": "Seated at the same table with our Mr.-, was a gentleman, who, to use the current phrase, 'had a brick in his hat.'.",
        "usedIdiom": "brick in his hat"
      },
      {
        "sentence": "Her husband had taken to the tavern, and often came home very late, \"with a brick in his hat,\" as Sally expressed it.",
        "usedIdiom": "brick in his hat"
      }
    ],
    "wrongExamples": [
      "The price of brick in one's hats has gone up.",
      "She collected several brick in one's hats for her hobby.",
      "She lost her brick in one's hat last week.",
      "This brick in one's hat is made of plastic.",
      "I've never seen a brick in one's hat like that before."
    ]
  },
  {
    "id": "idiom_991",
    "idiom": "bridge-builder",
    "definition": "A builder of bridges.",
    "wrongDefinitions": [
      "a literal bridge-builder",
      "to create confusion",
      "being overly cautious"
    ],
    "examples": [
      {
        "sentence": "A longtime advocate for racial and social justice with a degree from Virginia Commonwealth University, Walker, 40, got into politics at the urging of Edwards, an African American woman widely praised as a bridge-builder between the city's haves and have-nots."
      }
    ],
    "wrongExamples": [
      "He bought a bridge-builder at the store.",
      "Where can I find a good bridge-builder?",
      "The bridge-builder was on sale yesterday.",
      "This bridge-builder is made of plastic.",
      "She collected several bridge-builders for her hobby."
    ]
  },
  {
    "id": "idiom_992",
    "idiom": "bridge over troubled waters",
    "definition": "Someone or something that provides support, comfort, and a means to overcome difficult times.",
    "wrongDefinitions": [
      "a literal bridge over troubled waters",
      "to make things better",
      "to celebrate prematurely"
    ],
    "examples": [],
    "wrongExamples": [
      "That bridge over troubled waters looks brand new.",
      "The bridge over troubled waters was on sale yesterday.",
      "Where can I find a good bridge over troubled waters?",
      "He bought a bridge over troubled waters at the store.",
      "I've never seen a bridge over troubled waters like that before."
    ]
  },
  {
    "id": "idiom_993",
    "idiom": "bridge the gap",
    "definition": "To serve as or create a connection between disconnected or disparate things.",
    "wrongDefinitions": [
      "exactly what \"bridge the gap\" sounds like",
      "to achieve success",
      "experiencing confusion"
    ],
    "examples": [
      {
        "sentence": "Today there is no doubt that Dominican women have been actively involved in building the community, in struggling to keep their cultural heritage alive, and in keeping families together by bridging the gap between Dominicans from the homeland and those who live in the United States."
      },
      {
        "sentence": "It is argued that the precautionary principle provides an important mechanism for bridging the gap between public and private sectors in their approach to financial harm."
      },
      {
        "sentence": "GWR ran trains between Salisbury and Cardiff Central, and between Romsey and Portsmouth Harbour, with buses bridging the gap."
      }
    ],
    "wrongExamples": [
      "bridge gap",
      "Can you teach me to bridge the gap?",
      "She learned to bridge the gap at school.",
      "It takes practice to bridge the gap correctly.",
      "Everyone should bridge the gap at least once."
    ]
  },
  {
    "id": "idiom_994",
    "idiom": "bright and early",
    "definition": "(Very) early in the morning.",
    "wrongDefinitions": [
      "a literal bright and early",
      "an unnecessary action",
      "remaining uncertain"
    ],
    "examples": [
      {
        "sentence": "And this morning, bright and early, the beak parted him from ten quid."
      },
      {
        "sentence": "Bright and early on Monday, Elon Musk sent the government a surprising new document. In it, the world's wealthiest man laid out his possible intentions towards Twitter, in which he has amassed a 9.2 percent stake, underlining how drastically his position had changed from a week ago."
      }
    ],
    "wrongExamples": [
      "He bought a bright and early at the store.",
      "That bright and early looks brand new.",
      "She collected several bright and earlys for her hobby.",
      "The bright and early was on sale yesterday.",
      "This bright and early is made of plastic."
    ]
  },
  {
    "id": "idiom_995",
    "idiom": "bright-eyed and bushy-tailed",
    "definition": "Eager, alert, enthusiastic, and lively.",
    "wrongDefinitions": [
      "a literal bright-eyed and bushy-tailed",
      "to achieve success",
      "to finish something completely"
    ],
    "examples": [
      {
        "sentence": "They're eager to learn, bright-eyed and bushy-tailed,\" coach Jon Gruden said."
      }
    ],
    "wrongExamples": [
      "My friend owns three bright-eyed and bushy-taileds.",
      "That bright-eyed and bushy-tailed looks brand new.",
      "She lost her bright-eyed and bushy-tailed last week.",
      "The price of bright-eyed and bushy-taileds has gone up.",
      "She collected several bright-eyed and bushy-taileds for her hobby."
    ]
  },
  {
    "id": "idiom_996",
    "idiom": "bright lights",
    "definition": "The glamour and glitz of a place, especially a big city.",
    "wrongDefinitions": [
      "a literal bright lights",
      "to face challenges",
      "lacking preparation"
    ],
    "examples": [
      {
        "sentence": "Synonyms: bright lights and cold steel, cold steel and bright lights."
      }
    ],
    "wrongExamples": [
      "That bright lights looks brand new.",
      "The price of bright lightss has gone up.",
      "She collected several bright lightss for her hobby.",
      "My friend owns three bright lightss.",
      "I've never seen a bright lights like that before."
    ]
  },
  {
    "id": "idiom_997",
    "idiom": "bright line",
    "definition": "A clear distinction in the context of a legal, moral, ethical, or analytical judgment.",
    "wrongDefinitions": [
      "a literal bright line",
      "to gain advantage",
      "demonstrating skill"
    ],
    "examples": [
      {
        "sentence": "In these situations, there is no bright line between aggressive play and outright cheating."
      }
    ],
    "wrongExamples": [
      "Where can I find a good bright line?",
      "The bright line was on sale yesterday.",
      "The price of bright lines has gone up.",
      "That bright line looks brand new.",
      "This bright line is made of plastic."
    ]
  },
  {
    "id": "idiom_998",
    "idiom": "bright-line rule",
    "definition": "A clear-cut rule, so that it is easy to make a decision.",
    "wrongDefinitions": [
      "a literal bright-line rule",
      "to face challenges",
      "being overly cautious"
    ],
    "examples": [],
    "wrongExamples": [
      "She collected several bright-line rules for her hobby.",
      "My friend owns three bright-line rules.",
      "Where can I find a good bright-line rule?",
      "This bright-line rule is made of plastic.",
      "The bright-line rule was on sale yesterday."
    ]
  },
  {
    "id": "idiom_999",
    "idiom": "bright side",
    "definition": "A consoling aspect of a difficult situation.",
    "wrongDefinitions": [
      "a literal bright side",
      "something done carelessly",
      "having excessive pride"
    ],
    "examples": [
      {
        "sentence": "God knows that I tried / Seeing the bright side / (I'm wide awake) / But I'm not blind anymore."
      }
    ],
    "wrongExamples": [
      "The price of bright sides has gone up.",
      "This bright side is made of plastic.",
      "She collected several bright sides for her hobby.",
      "She lost her bright side last week.",
      "The bright side was on sale yesterday."
    ]
  }
]